piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
#define UART_RSR_ECR_BE_Pos 2
#define UART_RSR_ECR_BE_Msk (0x1UL << UART_RSR_ECR_BE_Pos)
#define UART_RSR_ECR_BE     UART_RSR_ECR_BE_Msk

#define UART_RSR_ECR_OE_Pos 3
#define UART_RSR_ECR_OE_Msk (0x1UL << UART_RSR_ECR_OE_Pos)
#define UART_RSR_ECR_OE     UART_RSR_ECR_OE_Msk

/** @} */ /* End of group MDR32F23QI_UART_RSR_ECR */

/** @defgroup MDR32F23QI_UART_FR UART_FR
 * @{
 */

#define UART_FR_CTS_Pos  0
#define UART_FR_CTS_Msk  (0x1UL << UART_FR_CTS_Pos)
#define UART_FR_CTS      UART_FR_CTS_Msk

#define UART_FR_DSR_Pos  1
#define UART_FR_DSR_Msk  (0x1UL << UART_FR_DSR_Pos)
#define UART_FR_DSR      UART_FR_DSR_Msk

#define UART_FR_DCD_Pos  2
#define UART_FR_DCD_Msk  (0x1UL << UART_FR_DCD_Pos)
#define UART_FR_DCD      UART_FR_DCD_Msk

#define UART_FR_BUSY_Pos 3
#define UART_FR_BUSY_Msk (0x1UL << UART_FR_BUSY_Pos)
#define UART_FR_BUSY     UART_FR_BUSY_Msk

#define UART_FR_RXFE_Pos 4
#define UART_FR_RXFE_Msk (0x1UL << UART_FR_RXFE_Pos)
#define UART_FR_RXFE     UART_FR_RXFE_Msk

#define UART_FR_TXFF_Pos 5
#define UART_FR_TXFF_Msk (0x1UL << UART_FR_TXFF_Pos)
#define UART_FR_TXFF     UART_FR_TXFF_Msk

#define UART_FR_RXFF_Pos 6
#define UART_FR_RXFF_Msk (0x1UL << UART_FR_RXFF_Pos)
#define UART_FR_RXFF     UART_FR_RXFF_Msk

#define UART_FR_TXFE_Pos 7
#define UART_FR_TXFE_Msk (0x1UL << UART_FR_TXFE_Pos)
#define UART_FR_TXFE     UART_FR_TXFE_Msk

#define UART_FR_RI_Pos   8
#define UART_FR_RI_Msk   (0x1UL << UART_FR_RI_Pos)
#define UART_FR_RI       UART_FR_RI_Msk

/** @} */ /* End of group MDR32F23QI_UART_FR */

/** @defgroup MDR32F23QI_UART_ILPR UART_ILPR
 * @{
 */

#define UART_ILPR_ILPDVSR_Pos 0
#define UART_ILPR_ILPDVSR_Msk (0xFFUL << UART_ILPR_ILPDVSR_Pos)

/** @} */ /* End of group MDR32F23QI_UART_ILPR */

/** @defgroup MDR32F23QI_UART_IBRD UART_IBRD
 * @{
 */

#define UART_IBRD_BAUD_DIVINT_Pos 0
#define UART_IBRD_BAUD_DIVINT_Msk (0xFFFFUL << UART_IBRD_BAUD_DIVINT_Pos)

/** @} */ /* End of group MDR32F23QI_UART_IBRD */

/** @defgroup MDR32F23QI_UART_FBRD UART_FBRD
 * @{
 */

#define UART_FBRD_BAUD_DIVFRAC_Pos 0
#define UART_FBRD_BAUD_DIVFRAC_Msk (0x3FUL << UART_FBRD_BAUD_DIVFRAC_Pos)

/** @} */ /* End of group MDR32F23QI_UART_FBRD */

/** @defgroup MDR32F23QI_UART_LCR_H UART_LCR_H
 * @{
 */

#define UART_LCR_H_BRK_Pos   0
#define UART_LCR_H_BRK_Msk   (0x1UL << UART_LCR_H_BRK_Pos)
#define UART_LCR_H_BRK       UART_LCR_H_BRK_Msk

#define UART_LCR_H_PEN_Pos   1
#define UART_LCR_H_PEN_Msk   (0x1UL << UART_LCR_H_PEN_Pos)
#define UART_LCR_H_PEN       UART_LCR_H_PEN_Msk

#define UART_LCR_H_EPS_Pos   2
#define UART_LCR_H_EPS_Msk   (0x1UL << UART_LCR_H_EPS_Pos)
#define UART_LCR_H_EPS       UART_LCR_H_EPS_Msk

#define UART_LCR_H_STP2_Pos  3
#define UART_LCR_H_STP2_Msk  (0x1UL << UART_LCR_H_STP2_Pos)
#define UART_LCR_H_STP2      UART_LCR_H_STP2_Msk

#define UART_LCR_H_FEN_Pos   4
#define UART_LCR_H_FEN_Msk   (0x1UL << UART_LCR_H_FEN_Pos)
#define UART_LCR_H_FEN       UART_LCR_H_FEN_Msk

#define UART_LCR_H_WLEN_Pos  5
#define UART_LCR_H_WLEN_Msk  (0x3UL << UART_LCR_H_WLEN_Pos)
#define UART_LCR_H_WLEN_5BIT (0x0UL << UART_LCR_H_WLEN_Pos)
#define UART_LCR_H_WLEN_6BIT (0x1UL << UART_LCR_H_WLEN_Pos)
#define UART_LCR_H_WLEN_7BIT (0x2UL << UART_LCR_H_WLEN_Pos)
#define UART_LCR_H_WLEN_8BIT (0x3UL << UART_LCR_H_WLEN_Pos)

#define UART_LCR_H_SPS_Pos   7
#define UART_LCR_H_SPS_Msk   (0x1UL << UART_LCR_H_SPS_Pos)
#define UART_LCR_H_SPS       UART_LCR_H_SPS_Msk

/** @} */ /* End of group MDR32F23QI_UART_LCR_H */

/** @defgroup MDR32F23QI_UART_CR UART_CR
 * @{
 */

#define UART_CR_UARTEN_Pos 0
#define UART_CR_UARTEN_Msk (0x1UL << UART_CR_UARTEN_Pos)
#define UART_CR_UARTEN     UART_CR_UARTEN_Msk

#define UART_CR_SIREN_Pos  1
#define UART_CR_SIREN_Msk  (0x1UL << UART_CR_SIREN_Pos)
#define UART_CR_SIREN      UART_CR_SIREN_Msk

#define UART_CR_SIRLP_Pos  2
#define UART_CR_SIRLP_Msk  (0x1UL << UART_CR_SIRLP_Pos)
#define UART_CR_SIRLP      UART_CR_SIRLP_Msk

#define UART_CR_LBE_Pos    7
#define UART_CR_LBE_Msk    (0x1UL << UART_CR_LBE_Pos)
#define UART_CR_LBE        UART_CR_LBE_Msk

#define UART_CR_TXE_Pos    8
#define UART_CR_TXE_Msk    (0x1UL << UART_CR_TXE_Pos)
#define UART_CR_TXE        UART_CR_TXE_Msk

#define UART_CR_RXE_Pos    9
#define UART_CR_RXE_Msk    (0x1UL << UART_CR_RXE_Pos)
#define UART_CR_RXE        UART_CR_RXE_Msk

#define UART_CR_DTR_Pos    10
#define UART_CR_DTR_Msk    (0x1UL << UART_CR_DTR_Pos)
#define UART_CR_DTR        UART_CR_DTR_Msk

#define UART_CR_RTS_Pos    11
#define UART_CR_RTS_Msk    (0x1UL << UART_CR_RTS_Pos)
#define UART_CR_RTS        UART_CR_RTS_Msk

#define UART_CR_OUT1_Pos   12
#define UART_CR_OUT1_Msk   (0x1UL << UART_CR_OUT1_Pos)
#define UART_CR_OUT1       UART_CR_OUT1_Msk

#define UART_CR_OUT2_Pos   13
#define UART_CR_OUT2_Msk   (0x1UL << UART_CR_OUT2_Pos)
#define UART_CR_OUT2       UART_CR_OUT2_Msk

#define UART_CR_RTSEN_Pos  14
#define UART_CR_RTSEN_Msk  (0x1UL << UART_CR_RTSEN_Pos)
#define UART_CR_RTSEN      UART_CR_RTSEN_Msk

#define UART_CR_CTSEN_Pos  15
#define UART_CR_CTSEN_Msk  (0x1UL << UART_CR_CTSEN_Pos)
#define UART_CR_CTSEN      UART_CR_CTSEN_Msk

/** @} */ /* End of group MDR32F23QI_UART_CR */

/** @defgroup MDR32F23QI_UART_IFLS UART_IFLS
 * @{
 */

#define UART_IFLS_TXIFLSEL_Pos    0
#define UART_IFLS_TXIFLSEL_Msk    (0x7UL << UART_IFLS_TXIFLSEL_Pos)
#define UART_IFLS_TXIFLSEL_2WORD  (0x0UL << UART_IFLS_TXIFLSEL_Pos)
#define UART_IFLS_TXIFLSEL_4WORD  (0x1UL << UART_IFLS_TXIFLSEL_Pos)
#define UART_IFLS_TXIFLSEL_8WORD  (0x2UL << UART_IFLS_TXIFLSEL_Pos)
#define UART_IFLS_TXIFLSEL_12WORD (0x3UL << UART_IFLS_TXIFLSEL_Pos)
#define UART_IFLS_TXIFLSEL_14WORD (0x4UL << UART_IFLS_TXIFLSEL_Pos)

#define UART_IFLS_RXIFLSEL_Pos    3
#define UART_IFLS_RXIFLSEL_Msk    (0x7UL << UART_IFLS_RXIFLSEL_Pos)
#define UART_IFLS_RXIFLSEL_2WORD  (0x0UL << UART_IFLS_RXIFLSEL_Pos)
#define UART_IFLS_RXIFLSEL_4WORD  (0x1UL << UART_IFLS_RXIFLSEL_Pos)
#define UART_IFLS_RXIFLSEL_8WORD  (0x2UL << UART_IFLS_RXIFLSEL_Pos)
#define UART_IFLS_RXIFLSEL_12WORD (0x3UL << UART_IFLS_RXIFLSEL_Pos)
#define UART_IFLS_RXIFLSEL_14WORD (0x4UL << UART_IFLS_RXIFLSEL_Pos)

/** @} */ /* End of group MDR32F23QI_UART_IFLS */

/** @defgroup MDR32F23QI_UART_IMSC UART_IMSC
 * @{
 */

#define UART_IMSC_RIMIM_Pos  0
#define UART_IMSC_RIMIM_Msk  (0x1UL << UART_IMSC_RIMIM_Pos)
#define UART_IMSC_RIMIM      UART_IMSC_RIMIM_Msk

#define UART_IMSC_CTSMIM_Pos 1
#define UART_IMSC_CTSMIM_Msk (0x1UL << UART_IMSC_CTSMIM_Pos)
#define UART_IMSC_CTSMIM     UART_IMSC_CTSMIM_Msk

#define UART_IMSC_DCDMIM_Pos 2
#define UART_IMSC_DCDMIM_Msk (0x1UL << UART_IMSC_DCDMIM_Pos)
#define UART_IMSC_DCDMIM     UART_IMSC_DCDMIM_Msk

#define UART_IMSC_DSRMIM_Pos 3
#define UART_IMSC_DSRMIM_Msk (0x1UL << UART_IMSC_DSRMIM_Pos)
#define UART_IMSC_DSRMIM     UART_IMSC_DSRMIM_Msk

#define UART_IMSC_RXIM_Pos   4
#define UART_IMSC_RXIM_Msk   (0x1UL << UART_IMSC_RXIM_Pos)
#define UART_IMSC_RXIM       UART_IMSC_RXIM_Msk

