piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
#define UART_IMSC_TXIM_Pos   5
#define UART_IMSC_TXIM_Msk   (0x1UL << UART_IMSC_TXIM_Pos)
#define UART_IMSC_TXIM       UART_IMSC_TXIM_Msk

#define UART_IMSC_RTIM_Pos   6
#define UART_IMSC_RTIM_Msk   (0x1UL << UART_IMSC_RTIM_Pos)
#define UART_IMSC_RTIM       UART_IMSC_RTIM_Msk

#define UART_IMSC_FEIM_Pos   7
#define UART_IMSC_FEIM_Msk   (0x1UL << UART_IMSC_FEIM_Pos)
#define UART_IMSC_FEIM       UART_IMSC_FEIM_Msk

#define UART_IMSC_PEIM_Pos   8
#define UART_IMSC_PEIM_Msk   (0x1UL << UART_IMSC_PEIM_Pos)
#define UART_IMSC_PEIM       UART_IMSC_PEIM_Msk

#define UART_IMSC_BEIM_Pos   9
#define UART_IMSC_BEIM_Msk   (0x1UL << UART_IMSC_BEIM_Pos)
#define UART_IMSC_BEIM       UART_IMSC_BEIM_Msk

#define UART_IMSC_OEIM_Pos   10
#define UART_IMSC_OEIM_Msk   (0x1UL << UART_IMSC_OEIM_Pos)
#define UART_IMSC_OEIM       UART_IMSC_OEIM_Msk

/** @} */ /* End of group MDR32F23QI_UART_IMSC */

/** @defgroup MDR32F23QI_UART_RIS UART_RIS
 * @{
 */

#define UART_RIS_RIRMIS_Pos  0
#define UART_RIS_RIRMIS_Msk  (0x1UL << UART_RIS_RIRMIS_Pos)
#define UART_RIS_RIRMIS      UART_RIS_RIRMIS_Msk

#define UART_RIS_CTSRMIS_Pos 1
#define UART_RIS_CTSRMIS_Msk (0x1UL << UART_RIS_CTSRMIS_Pos)
#define UART_RIS_CTSRMIS     UART_RIS_CTSRMIS_Msk

#define UART_RIS_DCDRMIS_Pos 2
#define UART_RIS_DCDRMIS_Msk (0x1UL << UART_RIS_DCDRMIS_Pos)
#define UART_RIS_DCDRMIS     UART_RIS_DCDRMIS_Msk

#define UART_RIS_DSRRMIS_Pos 3
#define UART_RIS_DSRRMIS_Msk (0x1UL << UART_RIS_DSRRMIS_Pos)
#define UART_RIS_DSRRMIS     UART_RIS_DSRRMIS_Msk

#define UART_RIS_RXRIS_Pos   4
#define UART_RIS_RXRIS_Msk   (0x1UL << UART_RIS_RXRIS_Pos)
#define UART_RIS_RXRIS       UART_RIS_RXRIS_Msk

#define UART_RIS_TXRIS_Pos   5
#define UART_RIS_TXRIS_Msk   (0x1UL << UART_RIS_TXRIS_Pos)
#define UART_RIS_TXRIS       UART_RIS_TXRIS_Msk

#define UART_RIS_RTRIS_Pos   6
#define UART_RIS_RTRIS_Msk   (0x1UL << UART_RIS_RTRIS_Pos)
#define UART_RIS_RTRIS       UART_RIS_RTRIS_Msk

#define UART_RIS_FERIS_Pos   7
#define UART_RIS_FERIS_Msk   (0x1UL << UART_RIS_FERIS_Pos)
#define UART_RIS_FERIS       UART_RIS_FERIS_Msk

#define UART_RIS_PERIS_Pos   8
#define UART_RIS_PERIS_Msk   (0x1UL << UART_RIS_PERIS_Pos)
#define UART_RIS_PERIS       UART_RIS_PERIS_Msk

#define UART_RIS_BERIS_Pos   9
#define UART_RIS_BERIS_Msk   (0x1UL << UART_RIS_BERIS_Pos)
#define UART_RIS_BERIS       UART_RIS_BERIS_Msk

#define UART_RIS_OERIS_Pos   10
#define UART_RIS_OERIS_Msk   (0x1UL << UART_RIS_OERIS_Pos)
#define UART_RIS_OERIS       UART_RIS_OERIS_Msk

/** @} */ /* End of group MDR32F23QI_UART_RIS */

/** @defgroup MDR32F23QI_UART_MIS UART_MIS
 * @{
 */

#define UART_MIS_RIMMIS_Pos  0
#define UART_MIS_RIMMIS_Msk  (0x1UL << UART_MIS_RIMMIS_Pos)
#define UART_MIS_RIMMIS      UART_MIS_RIMMIS_Msk

#define UART_MIS_CTSMMIS_Pos 1
#define UART_MIS_CTSMMIS_Msk (0x1UL << UART_MIS_CTSMMIS_Pos)
#define UART_MIS_CTSMMIS     UART_MIS_CTSMMIS_Msk

#define UART_MIS_DCDMMIS_Pos 2
#define UART_MIS_DCDMMIS_Msk (0x1UL << UART_MIS_DCDMMIS_Pos)
#define UART_MIS_DCDMMIS     UART_MIS_DCDMMIS_Msk

#define UART_MIS_DSRMMIS_Pos 3
#define UART_MIS_DSRMMIS_Msk (0x1UL << UART_MIS_DSRMMIS_Pos)
#define UART_MIS_DSRMMIS     UART_MIS_DSRMMIS_Msk

#define UART_MIS_RXMIS_Pos   4
#define UART_MIS_RXMIS_Msk   (0x1UL << UART_MIS_RXMIS_Pos)
#define UART_MIS_RXMIS       UART_MIS_RXMIS_Msk

#define UART_MIS_TXMIS_Pos   5
#define UART_MIS_TXMIS_Msk   (0x1UL << UART_MIS_TXMIS_Pos)
#define UART_MIS_TXMIS       UART_MIS_TXMIS_Msk

#define UART_MIS_RTMIS_Pos   6
#define UART_MIS_RTMIS_Msk   (0x1UL << UART_MIS_RTMIS_Pos)
#define UART_MIS_RTMIS       UART_MIS_RTMIS_Msk

#define UART_MIS_FEMIS_Pos   7
#define UART_MIS_FEMIS_Msk   (0x1UL << UART_MIS_FEMIS_Pos)
#define UART_MIS_FEMIS       UART_MIS_FEMIS_Msk

#define UART_MIS_PEMIS_Pos   8
#define UART_MIS_PEMIS_Msk   (0x1UL << UART_MIS_PEMIS_Pos)
#define UART_MIS_PEMIS       UART_MIS_PEMIS_Msk

#define UART_MIS_BEMIS_Pos   9
#define UART_MIS_BEMIS_Msk   (0x1UL << UART_MIS_BEMIS_Pos)
#define UART_MIS_BEMIS       UART_MIS_BEMIS_Msk

#define UART_MIS_OEMIS_Pos   10
#define UART_MIS_OEMIS_Msk   (0x1UL << UART_MIS_OEMIS_Pos)
#define UART_MIS_OEMIS       UART_MIS_OEMIS_Msk

/** @} */ /* End of group MDR32F23QI_UART_MIS */

/** @defgroup MDR32F23QI_UART_ICR UART_ICR
 * @{
 */

#define UART_ICR_RIMIC_Pos  0
#define UART_ICR_RIMIC_Msk  (0x1UL << UART_ICR_RIMIC_Pos)
#define UART_ICR_RIMIC      UART_ICR_RIMIC_Msk

#define UART_ICR_CTSMIC_Pos 1
#define UART_ICR_CTSMIC_Msk (0x1UL << UART_ICR_CTSMIC_Pos)
#define UART_ICR_CTSMIC     UART_ICR_CTSMIC_Msk

#define UART_ICR_DCDMIC_Pos 2
#define UART_ICR_DCDMIC_Msk (0x1UL << UART_ICR_DCDMIC_Pos)
#define UART_ICR_DCDMIC     UART_ICR_DCDMIC_Msk

#define UART_ICR_DSRMIC_Pos 3
#define UART_ICR_DSRMIC_Msk (0x1UL << UART_ICR_DSRMIC_Pos)
#define UART_ICR_DSRMIC     UART_ICR_DSRMIC_Msk

#define UART_ICR_RXIC_Pos   4
#define UART_ICR_RXIC_Msk   (0x1UL << UART_ICR_RXIC_Pos)
#define UART_ICR_RXIC       UART_ICR_RXIC_Msk

#define UART_ICR_TXIC_Pos   5
#define UART_ICR_TXIC_Msk   (0x1UL << UART_ICR_TXIC_Pos)
#define UART_ICR_TXIC       UART_ICR_TXIC_Msk

#define UART_ICR_RTIC_Pos   6
#define UART_ICR_RTIC_Msk   (0x1UL << UART_ICR_RTIC_Pos)
#define UART_ICR_RTIC       UART_ICR_RTIC_Msk

#define UART_ICR_FEIC_Pos   7
#define UART_ICR_FEIC_Msk   (0x1UL << UART_ICR_FEIC_Pos)
#define UART_ICR_FEIC       UART_ICR_FEIC_Msk

#define UART_ICR_PEIC_Pos   8
#define UART_ICR_PEIC_Msk   (0x1UL << UART_ICR_PEIC_Pos)
#define UART_ICR_PEIC       UART_ICR_PEIC_Msk

#define UART_ICR_BEIC_Pos   9
#define UART_ICR_BEIC_Msk   (0x1UL << UART_ICR_BEIC_Pos)
#define UART_ICR_BEIC       UART_ICR_BEIC_Msk

#define UART_ICR_OEIC_Pos   10
#define UART_ICR_OEIC_Msk   (0x1UL << UART_ICR_OEIC_Pos)
#define UART_ICR_OEIC       UART_ICR_OEIC_Msk

/** @} */ /* End of group MDR32F23QI_UART_ICR */

/** @} */ /* End of group MDR32F23QI_UART_Defines */

/** @} */ /* End of group MDR32F23QI_UART */

/** @defgroup MDR32F23QI_EEPROM MDR_EEPROM
 * @{
 */

/**
 * @brief MDR32F23QI EEPROM control structure
 */
typedef struct {
    __IO uint32_t CMD; /*!<EEPROM Command Register */
    __IO uint32_t ADR; /*!<EEPROM Address Register */
    __IO uint32_t DI;  /*!<EEPROM Read Data Register */
    __IO uint32_t DO;  /*!<EEPROM Write Data Register */
    __IO uint32_t KEY; /*!<EEPROM Key Register */
} MDR_EEPROM_TypeDef;

/** @defgroup MDR32F23QI_EEPROM_Defines EEPROM Defines
 * @{
 */

/** @defgroup MDR32F23QI_EEPROM_CMD EEPROM_CMD
 * @{
 */

#define EEPROM_CMD_CON_Pos       0
#define EEPROM_CMD_CON_Msk       (0x1UL << EEPROM_CMD_CON_Pos)
#define EEPROM_CMD_CON           EEPROM_CMD_CON_Msk

#define EEPROM_CMD_DELAY_Pos     3
#define EEPROM_CMD_DELAY_Msk     (0x3UL << EEPROM_CMD_DELAY_Pos)
#define EEPROM_CMD_DELAY_CYCLE_0 (0x0UL << EEPROM_CMD_DELAY_Pos)
#define EEPROM_CMD_DELAY_CYCLE_1 (0x1UL << EEPROM_CMD_DELAY_Pos)

#define EEPROM_CMD_XE_Pos        6
#define EEPROM_CMD_XE_Msk        (0x1UL << EEPROM_CMD_XE_Pos)
#define EEPROM_CMD_XE            EEPROM_CMD_XE_Msk

#define EEPROM_CMD_YE_Pos        7
#define EEPROM_CMD_YE_Msk        (0x1UL << EEPROM_CMD_YE_Pos)
#define EEPROM_CMD_YE            EEPROM_CMD_YE_Msk

#define EEPROM_CMD_SE_Pos        8
#define EEPROM_CMD_SE_Msk        (0x1UL << EEPROM_CMD_SE_Pos)
#define EEPROM_CMD_SE            EEPROM_CMD_SE_Msk

#define EEPROM_CMD_IFREN_Pos     9
#define EEPROM_CMD_IFREN_Msk     (0x1UL << EEPROM_CMD_IFREN_Pos)
#define EEPROM_CMD_IFREN         EEPROM_CMD_IFREN_Msk

#define EEPROM_CMD_ERASE_Pos     10
#define EEPROM_CMD_ERASE_Msk     (0x1UL << EEPROM_CMD_ERASE_Pos)
#define EEPROM_CMD_ERASE         EEPROM_CMD_ERASE_Msk

#define EEPROM_CMD_MAS1_Pos      11
#define EEPROM_CMD_MAS1_Msk      (0x1UL << EEPROM_CMD_MAS1_Pos)
#define EEPROM_CMD_MAS1          EEPROM_CMD_MAS1_Msk

#define EEPROM_CMD_PROG_Pos      12
#define EEPROM_CMD_PROG_Msk      (0x1UL << EEPROM_CMD_PROG_Pos)
#define EEPROM_CMD_PROG          EEPROM_CMD_PROG_Msk

#define EEPROM_CMD_NVSTR_Pos     13
#define EEPROM_CMD_NVSTR_Msk     (0x1UL << EEPROM_CMD_NVSTR_Pos)
#define EEPROM_CMD_NVSTR         EEPROM_CMD_NVSTR_Msk

/** @} */ /* End of group MDR32F23QI_EEPROM_CMD */

/** @defgroup MDR32F23QI_EEPROM_ADR EEPROM_ADR
 * @{
 */

#define EEPROM_ADR_ADR_Pos 0
#define EEPROM_ADR_ADR_Msk (0xFFFFFFFFUL << EEPROM_ADR_ADR_Pos)

/** @} */ /* End of group MDR32F23QI_EEPROM_ADR */

/** @defgroup MDR32F23QI_EEPROM_DI EEPROM_DI
 * @{
 */

#define EEPROM_DI_DATA_Pos 0
#define EEPROM_DI_DATA_Msk (0xFFFFFFFFUL << EEPROM_DI_DATA_Pos)

/** @} */ /* End of group MDR32F23QI_EEPROM_DI */

