piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
/** @defgroup MDR32F23QI_EEPROM_DO EEPROM_DO
 * @{
 */

#define EEPROM_DO_DATA_Pos 0
#define EEPROM_DO_DATA_Msk (0xFFFFFFFFUL << EEPROM_DO_DATA_Pos)

/** @} */ /* End of group MDR32F23QI_EEPROM_DO */

/** @defgroup MDR32F23QI_EEPROM_KEY EEPROM_KEY
 * @{
 */

#define EEPROM_KEY_KEY_Pos 0
#define EEPROM_KEY_KEY_Msk (0xFFFFFFFFUL << EEPROM_KEY_KEY_Pos)

/** @} */ /* End of group MDR32F23QI_EEPROM_KEY */

/** @} */ /* End of group MDR32F23QI_EEPROM_Defines */

/** @} */ /* End of group MDR32F23QI_EEPROM */

/** @defgroup MDR32F23QI_RST_CLK MDR_RST_CLK
 * @{
 */

/**
 * @brief MDR32F23QI RST_CLK control structure
 */
typedef struct {
    __IO uint32_t CLOCK_STATUS; /*!<RST_CLK Clock Status Register */
    __IO uint32_t PLL_CONTROL;  /*!<RST_CLK PLL Control Register */
    __IO uint32_t HS_CONTROL;   /*!<RST_CLK HS Control Register */
    __IO uint32_t CPU_CLOCK;    /*!<RST_CLK CPU Clock Register */
    __IO uint32_t PER1_CLOCK;   /*!<RST_CLK PER1 Clock Register */
    __IO uint32_t ADC_CLOCK;    /*!<RST_CLK ADC Clock Register */
    __IO uint32_t RTC_CLOCK;    /*!<RST_CLK RTC Clock Register */
    __IO uint32_t PER2_CLOCK;   /*!<RST_CLK Peripheral Clock Enable Register */
    __I uint32_t  RESERVED0;
    __IO uint32_t TIM_CLOCK;    /*!<RST_CLK Timer Clock Register */
    __IO uint32_t UART_CLOCK;   /*!<RST_CLK UART Clock Register */
    __IO uint32_t SSP_CLOCK;    /*!<RST_CLK SSP Clock Register */
} MDR_RST_CLK_TypeDef;

/** @defgroup MDR32F23QI_RST_CLK_Defines RST_CLK Defines
 * @{
 */

/** @defgroup MDR32F23QI_RST_CLK_CLOCK_STATUS RST_CLK CLOCK_STATUS
 * @{
 */

#define RST_CLK_CLOCK_STATUS_PLLCPURDY_Pos 1
#define RST_CLK_CLOCK_STATUS_PLLCPURDY_Msk (0x1UL << RST_CLK_CLOCK_STATUS_PLLCPURDY_Pos)
#define RST_CLK_CLOCK_STATUS_PLLCPURDY     RST_CLK_CLOCK_STATUS_PLLCPURDY_Msk

#define RST_CLK_CLOCK_STATUS_HSERDY_Pos    2
#define RST_CLK_CLOCK_STATUS_HSERDY_Msk    (0x1UL << RST_CLK_CLOCK_STATUS_HSERDY_Pos)
#define RST_CLK_CLOCK_STATUS_HSERDY        RST_CLK_CLOCK_STATUS_HSERDY_Msk

/** @} */ /* End of group MDR32F23QI_RST_CLK_CLOCK_STATUS */

/** @defgroup MDR32F23QI_RST_CLK_PLL_CONTROL RST_CLK PLL_CONTROL
 * @{
 */

#define RST_CLK_PLL_CONTROL_PLL_CPU_ON_Pos  2
#define RST_CLK_PLL_CONTROL_PLL_CPU_ON_Msk  (0x1UL << RST_CLK_PLL_CONTROL_PLL_CPU_ON_Pos)
#define RST_CLK_PLL_CONTROL_PLL_CPU_ON      RST_CLK_PLL_CONTROL_PLL_CPU_ON_Msk

#define RST_CLK_PLL_CONTROL_PLL_CPU_RLD_Pos 3
#define RST_CLK_PLL_CONTROL_PLL_CPU_RLD_Msk (0x1UL << RST_CLK_PLL_CONTROL_PLL_CPU_RLD_Pos)
#define RST_CLK_PLL_CONTROL_PLL_CPU_RLD     RST_CLK_PLL_CONTROL_PLL_CPU_RLD_Msk

#define RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Pos 8
#define RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Msk (0xFUL << RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Pos)

/** @} */ /* End of group MDR32F23QI_RST_CLK_PLL_CONTROL */

/** @defgroup MDR32F23QI_RST_CLK_HS_CONTROL RST_CLK HS_CONTROL
 * @{
 */

#define RST_CLK_HS_CONTROL_HSE_ON_Pos  0
#define RST_CLK_HS_CONTROL_HSE_ON_Msk  (0x1UL << RST_CLK_HS_CONTROL_HSE_ON_Pos)
#define RST_CLK_HS_CONTROL_HSE_ON      RST_CLK_HS_CONTROL_HSE_ON_Msk

#define RST_CLK_HS_CONTROL_HSE_BYP_Pos 1
#define RST_CLK_HS_CONTROL_HSE_BYP_Msk (0x1UL << RST_CLK_HS_CONTROL_HSE_BYP_Pos)
#define RST_CLK_HS_CONTROL_HSE_BYP     RST_CLK_HS_CONTROL_HSE_BYP_Msk

/** @} */ /* End of group MDR32F23QI_RST_CLK_HS_CONTROL */

/** @defgroup MDR32F23QI_RST_CLK_CPU_CLOCK RST_CLK CPU_CLOCK
 * @{
 */

#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos     0
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_Msk     (0x3UL << RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos)
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSI     (0x0UL << RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos)
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSIdiv2 (0x1UL << RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos)
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSE     (0x2UL << RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos)
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSEdiv2 (0x3UL << RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos)

#define RST_CLK_CPU_CLOCK_CPU_C2_SEL_Pos     2
#define RST_CLK_CPU_CLOCK_CPU_C2_SEL_Msk     (0x1UL << RST_CLK_CPU_CLOCK_CPU_C2_SEL_Pos)
#define RST_CLK_CPU_CLOCK_CPU_C2_SEL         RST_CLK_CPU_CLOCK_CPU_C2_SEL_Msk

#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos     4
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_Msk     (0xFUL << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos)

#define RST_CLK_CPU_CLOCK_HCLK_SEL_Pos       8
#define RST_CLK_CPU_CLOCK_HCLK_SEL_Msk       (0x3UL << RST_CLK_CPU_CLOCK_HCLK_SEL_Pos)
#define RST_CLK_CPU_CLOCK_HCLK_SEL_HSI       (0x0UL << RST_CLK_CPU_CLOCK_HCLK_SEL_Pos)
#define RST_CLK_CPU_CLOCK_HCLK_SEL_CPU_C3    (0x1UL << RST_CLK_CPU_CLOCK_HCLK_SEL_Pos)
#define RST_CLK_CPU_CLOCK_HCLK_SEL_LSE       (0x2UL << RST_CLK_CPU_CLOCK_HCLK_SEL_Pos)
#define RST_CLK_CPU_CLOCK_HCLK_SEL_LSI       (0x3UL << RST_CLK_CPU_CLOCK_HCLK_SEL_Pos)

/** @} */ /* End of group MDR32F23QI_RST_CLK_CPU_CLOCK */

/** @defgroup MDR32F23QI_RST_CLK_PER1_CLOCK RST_CLK PER1_CLOCK
 * @{
 */

#define RST_CLK_PER1_CLOCK_C1_SEL_Pos           0
#define RST_CLK_PER1_CLOCK_C1_SEL_Msk           (0x3UL << RST_CLK_PER1_CLOCK_C1_SEL_Pos)
#define RST_CLK_PER1_CLOCK_C1_SEL_LSI           (0x0UL << RST_CLK_PER1_CLOCK_C1_SEL_Pos)
#define RST_CLK_PER1_CLOCK_C1_SEL_LSIdiv2       (0x1UL << RST_CLK_PER1_CLOCK_C1_SEL_Pos)
#define RST_CLK_PER1_CLOCK_C1_SEL_LSE           (0x2UL << RST_CLK_PER1_CLOCK_C1_SEL_Pos)
#define RST_CLK_PER1_CLOCK_C1_SEL_LSEdiv2       (0x3UL << RST_CLK_PER1_CLOCK_C1_SEL_Pos)

#define RST_CLK_PER1_CLOCK_TIM0_C2_SEL_Pos      2
#define RST_CLK_PER1_CLOCK_TIM0_C2_SEL_Msk      (0x3UL << RST_CLK_PER1_CLOCK_TIM0_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_TIM0_C2_SEL_CPU_C1   (0x0UL << RST_CLK_PER1_CLOCK_TIM0_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_TIM0_C2_SEL_PER1_C1  (0x1UL << RST_CLK_PER1_CLOCK_TIM0_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_TIM0_C2_SEL_PLLCPUo  (0x2UL << RST_CLK_PER1_CLOCK_TIM0_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_TIM0_C2_SEL_HSI_CLK  (0x3UL << RST_CLK_PER1_CLOCK_TIM0_C2_SEL_Pos)

#define RST_CLK_PER1_CLOCK_DEBUG_EN_Pos         4
#define RST_CLK_PER1_CLOCK_DEBUG_EN_Msk         (0x1UL << RST_CLK_PER1_CLOCK_DEBUG_EN_Pos)
#define RST_CLK_PER1_CLOCK_DEBUG_EN             RST_CLK_PER1_CLOCK_DEBUG_EN_Msk

#define RST_CLK_PER1_CLOCK_TIM1_C2_SEL_Pos      6
#define RST_CLK_PER1_CLOCK_TIM1_C2_SEL_Msk      (0x3UL << RST_CLK_PER1_CLOCK_TIM1_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_TIM1_C2_SEL_CPU_C1   (0x0UL << RST_CLK_PER1_CLOCK_TIM1_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_TIM1_C2_SEL_PER1_C1  (0x1UL << RST_CLK_PER1_CLOCK_TIM1_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_TIM1_C2_SEL_PLLCPUo  (0x2UL << RST_CLK_PER1_CLOCK_TIM1_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_TIM1_C2_SEL_HSI_CLK  (0x3UL << RST_CLK_PER1_CLOCK_TIM1_C2_SEL_Pos)

#define RST_CLK_PER1_CLOCK_UART0_C2_SEL_Pos     8
#define RST_CLK_PER1_CLOCK_UART0_C2_SEL_Msk     (0x3UL << RST_CLK_PER1_CLOCK_UART0_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_UART0_C2_SEL_CPU_C1  (0x0UL << RST_CLK_PER1_CLOCK_UART0_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_UART0_C2_SEL_PER1_C1 (0x1UL << RST_CLK_PER1_CLOCK_UART0_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_UART0_C2_SEL_PLLCPUo (0x2UL << RST_CLK_PER1_CLOCK_UART0_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_UART0_C2_SEL_HSI_CLK (0x3UL << RST_CLK_PER1_CLOCK_UART0_C2_SEL_Pos)

