piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
#define RST_CLK_PER1_CLOCK_UART1_C2_SEL_Pos     10
#define RST_CLK_PER1_CLOCK_UART1_C2_SEL_Msk     (0x3UL << RST_CLK_PER1_CLOCK_UART1_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_UART1_C2_SEL_CPU_C1  (0x0UL << RST_CLK_PER1_CLOCK_UART1_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_UART1_C2_SEL_PER1_C1 (0x1UL << RST_CLK_PER1_CLOCK_UART1_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_UART1_C2_SEL_PLLCPUo (0x2UL << RST_CLK_PER1_CLOCK_UART1_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_UART1_C2_SEL_HSI_CLK (0x3UL << RST_CLK_PER1_CLOCK_UART1_C2_SEL_Pos)

#define RST_CLK_PER1_CLOCK_SSP_C2_SEL_Pos       12
#define RST_CLK_PER1_CLOCK_SSP_C2_SEL_Msk       (0x3UL << RST_CLK_PER1_CLOCK_SSP_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_SSP_C2_SEL_CPU_C1    (0x0UL << RST_CLK_PER1_CLOCK_SSP_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_SSP_C2_SEL_PER1_C1   (0x1UL << RST_CLK_PER1_CLOCK_SSP_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_SSP_C2_SEL_PLLCPUo   (0x2UL << RST_CLK_PER1_CLOCK_SSP_C2_SEL_Pos)
#define RST_CLK_PER1_CLOCK_SSP_C2_SEL_HSI_CLK   (0x3UL << RST_CLK_PER1_CLOCK_SSP_C2_SEL_Pos)

/** @} */ /* End of group MDR32F23QI_RST_CLK_PER1_CLOCK */

/** @defgroup MDR32F23QI_RST_CLK_ADC_CLOCK RST_CLK ADC_CLOCK
 * @{
 */

#define RST_CLK_ADC_CLOCK_ADC_C1_SEL_Pos       0
#define RST_CLK_ADC_CLOCK_ADC_C1_SEL_Msk       (0x3UL << RST_CLK_ADC_CLOCK_ADC_C1_SEL_Pos)
#define RST_CLK_ADC_CLOCK_ADC_C1_SEL_CPU_C1    (0x0UL << RST_CLK_ADC_CLOCK_ADC_C1_SEL_Pos)
#define RST_CLK_ADC_CLOCK_ADC_C1_SEL_PER1_C1   (0x1UL << RST_CLK_ADC_CLOCK_ADC_C1_SEL_Pos)
#define RST_CLK_ADC_CLOCK_ADC_C1_SEL_PLLCPUo   (0x2UL << RST_CLK_ADC_CLOCK_ADC_C1_SEL_Pos)
#define RST_CLK_ADC_CLOCK_ADC_C1_SEL_HSI_CLK   (0x3UL << RST_CLK_ADC_CLOCK_ADC_C1_SEL_Pos)

#define RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_Pos     2
#define RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_Msk     (0x3UL << RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_Pos)
#define RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_CPU_C1  (0x0UL << RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_Pos)
#define RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_PER1_C1 (0x1UL << RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_Pos)
#define RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_PLLCPUo (0x2UL << RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_Pos)
#define RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_HSI_CLK (0x3UL << RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_Pos)

#define RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos     4
#define RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Msk     (0xFUL << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos)

#define RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos       8
#define RST_CLK_ADC_CLOCK_ADC_C3_SEL_Msk       (0xFUL << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos)

#define RST_CLK_ADC_CLOCK_ADCUI_CLK_EN_Pos     12
#define RST_CLK_ADC_CLOCK_ADCUI_CLK_EN_Msk     (0x1UL << RST_CLK_ADC_CLOCK_ADCUI_CLK_EN_Pos)
#define RST_CLK_ADC_CLOCK_ADCUI_CLK_EN         RST_CLK_ADC_CLOCK_ADCUI_CLK_EN_Msk

#define RST_CLK_ADC_CLOCK_ADC_CLK_EN_Pos       13
#define RST_CLK_ADC_CLOCK_ADC_CLK_EN_Msk       (0x1UL << RST_CLK_ADC_CLOCK_ADC_CLK_EN_Pos)
#define RST_CLK_ADC_CLOCK_ADC_CLK_EN           RST_CLK_ADC_CLOCK_ADC_CLK_EN_Msk

/** @} */ /* End of group MDR32F23QI_RST_CLK_ADC_CLOCK */

/** @defgroup MDR32F23QI_RST_CLK_RTC_CLOCK RST_CLK RTC_CLOCK
 * @{
 */

#define RST_CLK_RTC_CLOCK_HSE_SEL_Pos    0
#define RST_CLK_RTC_CLOCK_HSE_SEL_Msk    (0xFUL << RST_CLK_RTC_CLOCK_HSE_SEL_Pos)

#define RST_CLK_RTC_CLOCK_HSI_SEL_Pos    4
#define RST_CLK_RTC_CLOCK_HSI_SEL_Msk    (0xFUL << RST_CLK_RTC_CLOCK_HSI_SEL_Pos)

#define RST_CLK_RTC_CLOCK_HSE_RTC_EN_Pos 8
#define RST_CLK_RTC_CLOCK_HSE_RTC_EN_Msk (0x1UL << RST_CLK_RTC_CLOCK_HSE_RTC_EN_Pos)
#define RST_CLK_RTC_CLOCK_HSE_RTC_EN     RST_CLK_RTC_CLOCK_HSE_RTC_EN_Msk

#define RST_CLK_RTC_CLOCK_HSI_RTC_EN_Pos 9
#define RST_CLK_RTC_CLOCK_HSI_RTC_EN_Msk (0x1UL << RST_CLK_RTC_CLOCK_HSI_RTC_EN_Pos)
#define RST_CLK_RTC_CLOCK_HSI_RTC_EN     RST_CLK_RTC_CLOCK_HSI_RTC_EN_Msk

/** @} */ /* End of group MDR32F23QI_RST_CLK_RTC_CLOCK */

/** @defgroup MDR32F23QI_RST_CLK_PER2_CLOCK RST_CLK PER2_CLOCK
 * @{
 */

#define RST_CLK_PER2_CLOCK_PCLK_EN_SPI_Pos     0
#define RST_CLK_PER2_CLOCK_PCLK_EN_SPI_Msk     (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_SPI_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_SPI         RST_CLK_PER2_CLOCK_PCLK_EN_SPI_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_UART0_Pos   1
#define RST_CLK_PER2_CLOCK_PCLK_EN_UART0_Msk   (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_UART0_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_UART0       RST_CLK_PER2_CLOCK_PCLK_EN_UART0_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_UART1_Pos   2
#define RST_CLK_PER2_CLOCK_PCLK_EN_UART1_Msk   (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_UART1_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_UART1       RST_CLK_PER2_CLOCK_PCLK_EN_UART1_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_EEPROM_Pos  3
#define RST_CLK_PER2_CLOCK_PCLK_EN_EEPROM_Msk  (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_EEPROM_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_EEPROM      RST_CLK_PER2_CLOCK_PCLK_EN_EEPROM_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_RST_CLK_Pos 4
#define RST_CLK_PER2_CLOCK_PCLK_EN_RST_CLK_Msk (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_RST_CLK_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_RST_CLK     RST_CLK_PER2_CLOCK_PCLK_EN_RST_CLK_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_I2C_Pos     6
#define RST_CLK_PER2_CLOCK_PCLK_EN_I2C_Msk     (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_I2C_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_I2C         RST_CLK_PER2_CLOCK_PCLK_EN_I2C_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_LCD_Pos     7
#define RST_CLK_PER2_CLOCK_PCLK_EN_LCD_Msk     (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_LCD_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_LCD         RST_CLK_PER2_CLOCK_PCLK_EN_LCD_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_ADC_Pos     8
#define RST_CLK_PER2_CLOCK_PCLK_EN_ADC_Msk     (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_ADC_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_ADC         RST_CLK_PER2_CLOCK_PCLK_EN_ADC_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_WWDT_Pos    9
#define RST_CLK_PER2_CLOCK_PCLK_EN_WWDT_Msk    (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_WWDT_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_WWDT        RST_CLK_PER2_CLOCK_PCLK_EN_WWDT_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_IWDT_Pos    10
#define RST_CLK_PER2_CLOCK_PCLK_EN_IWDT_Msk    (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_IWDT_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_IWDT        RST_CLK_PER2_CLOCK_PCLK_EN_IWDT_Msk

