piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
#define RST_CLK_PER2_CLOCK_PCLK_EN_POWER_Pos   11
#define RST_CLK_PER2_CLOCK_PCLK_EN_POWER_Msk   (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_POWER_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_POWER       RST_CLK_PER2_CLOCK_PCLK_EN_POWER_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_BKP_Pos     12
#define RST_CLK_PER2_CLOCK_PCLK_EN_BKP_Msk     (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_BKP_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_BKP         RST_CLK_PER2_CLOCK_PCLK_EN_BKP_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_ADCUI_Pos   13
#define RST_CLK_PER2_CLOCK_PCLK_EN_ADCUI_Msk   (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_ADCUI_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_ADCUI       RST_CLK_PER2_CLOCK_PCLK_EN_ADCUI_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_TIMER0_Pos  14
#define RST_CLK_PER2_CLOCK_PCLK_EN_TIMER0_Msk  (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_TIMER0_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_TIMER0      RST_CLK_PER2_CLOCK_PCLK_EN_TIMER0_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_TIMER1_Pos  15
#define RST_CLK_PER2_CLOCK_PCLK_EN_TIMER1_Msk  (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_TIMER1_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_TIMER1      RST_CLK_PER2_CLOCK_PCLK_EN_TIMER1_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_PORTA_Pos   16
#define RST_CLK_PER2_CLOCK_PCLK_EN_PORTA_Msk   (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_PORTA_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_PORTA       RST_CLK_PER2_CLOCK_PCLK_EN_PORTA_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_PORTB_Pos   17
#define RST_CLK_PER2_CLOCK_PCLK_EN_PORTB_Msk   (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_PORTB_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_PORTB       RST_CLK_PER2_CLOCK_PCLK_EN_PORTB_Msk

#define RST_CLK_PER2_CLOCK_PCLK_EN_PORTC_Pos   18
#define RST_CLK_PER2_CLOCK_PCLK_EN_PORTC_Msk   (0x1UL << RST_CLK_PER2_CLOCK_PCLK_EN_PORTC_Pos)
#define RST_CLK_PER2_CLOCK_PCLK_EN_PORTC       RST_CLK_PER2_CLOCK_PCLK_EN_PORTC_Msk

/** @} */ /* End of group MDR32F23QI_RST_CLK_PER2_CLOCK */

/** @defgroup MDR32F23QI_RST_CLK_TIM_CLOCK RST_CLK TIM_CLOCK
 * @{
 */

#define RST_CLK_TIM_CLOCK_TIM0_BRG_Pos    0
#define RST_CLK_TIM_CLOCK_TIM0_BRG_Msk    (0x7UL << RST_CLK_TIM_CLOCK_TIM0_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM0_BRG_DIV1   (0x0UL << RST_CLK_TIM_CLOCK_TIM0_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM0_BRG_DIV2   (0x1UL << RST_CLK_TIM_CLOCK_TIM0_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM0_BRG_DIV4   (0x2UL << RST_CLK_TIM_CLOCK_TIM0_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM0_BRG_DIV8   (0x3UL << RST_CLK_TIM_CLOCK_TIM0_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM0_BRG_DIV16  (0x4UL << RST_CLK_TIM_CLOCK_TIM0_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM0_BRG_DIV32  (0x5UL << RST_CLK_TIM_CLOCK_TIM0_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM0_BRG_DIV64  (0x6UL << RST_CLK_TIM_CLOCK_TIM0_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM0_BRG_DIV128 (0x7UL << RST_CLK_TIM_CLOCK_TIM0_BRG_Pos)

#define RST_CLK_TIM_CLOCK_TIM1_BRG_Pos    8
#define RST_CLK_TIM_CLOCK_TIM1_BRG_Msk    (0x7UL << RST_CLK_TIM_CLOCK_TIM1_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM1_BRG_DIV1   (0x0UL << RST_CLK_TIM_CLOCK_TIM1_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM1_BRG_DIV2   (0x1UL << RST_CLK_TIM_CLOCK_TIM1_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM1_BRG_DIV4   (0x2UL << RST_CLK_TIM_CLOCK_TIM1_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM1_BRG_DIV8   (0x3UL << RST_CLK_TIM_CLOCK_TIM1_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM1_BRG_DIV16  (0x4UL << RST_CLK_TIM_CLOCK_TIM1_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM1_BRG_DIV32  (0x5UL << RST_CLK_TIM_CLOCK_TIM1_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM1_BRG_DIV64  (0x6UL << RST_CLK_TIM_CLOCK_TIM1_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM1_BRG_DIV128 (0x7UL << RST_CLK_TIM_CLOCK_TIM1_BRG_Pos)

#define RST_CLK_TIM_CLOCK_TIM0_CLK_EN_Pos 24
#define RST_CLK_TIM_CLOCK_TIM0_CLK_EN_Msk (0x1UL << RST_CLK_TIM_CLOCK_TIM0_CLK_EN_Pos)
#define RST_CLK_TIM_CLOCK_TIM0_CLK_EN     RST_CLK_TIM_CLOCK_TIM0_CLK_EN_Msk

#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Pos 25
#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Msk (0x1UL << RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Pos)
#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN     RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Msk

/** @} */ /* End of group MDR32F23QI_RST_CLK_TIM_CLOCK */

/** @defgroup MDR32F23QI_RST_CLK_UART_CLOCK RST_CLK UART_CLOCK
 * @{
 */

#define RST_CLK_UART_CLOCK_UART0_BRG_Pos    0
#define RST_CLK_UART_CLOCK_UART0_BRG_Msk    (0x7UL << RST_CLK_UART_CLOCK_UART0_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART0_BRG_DIV1   (0x0UL << RST_CLK_UART_CLOCK_UART0_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART0_BRG_DIV2   (0x1UL << RST_CLK_UART_CLOCK_UART0_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART0_BRG_DIV4   (0x2UL << RST_CLK_UART_CLOCK_UART0_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART0_BRG_DIV8   (0x3UL << RST_CLK_UART_CLOCK_UART0_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART0_BRG_DIV16  (0x4UL << RST_CLK_UART_CLOCK_UART0_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART0_BRG_DIV32  (0x5UL << RST_CLK_UART_CLOCK_UART0_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART0_BRG_DIV64  (0x6UL << RST_CLK_UART_CLOCK_UART0_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART0_BRG_DIV128 (0x7UL << RST_CLK_UART_CLOCK_UART0_BRG_Pos)

#define RST_CLK_UART_CLOCK_UART1_BRG_Pos    8
#define RST_CLK_UART_CLOCK_UART1_BRG_Msk    (0x7UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV1   (0x0UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV2   (0x1UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV4   (0x2UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV8   (0x3UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV16  (0x4UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV32  (0x5UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV64  (0x6UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV128 (0x7UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)

#define RST_CLK_UART_CLOCK_UART0_CLK_EN_Pos 24
#define RST_CLK_UART_CLOCK_UART0_CLK_EN_Msk (0x1UL << RST_CLK_UART_CLOCK_UART0_CLK_EN_Pos)
#define RST_CLK_UART_CLOCK_UART0_CLK_EN     RST_CLK_UART_CLOCK_UART0_CLK_EN_Msk

#define RST_CLK_UART_CLOCK_UART1_CLK_EN_Pos 25
#define RST_CLK_UART_CLOCK_UART1_CLK_EN_Msk (0x1UL << RST_CLK_UART_CLOCK_UART1_CLK_EN_Pos)
#define RST_CLK_UART_CLOCK_UART1_CLK_EN     RST_CLK_UART_CLOCK_UART1_CLK_EN_Msk

/** @} */ /* End of group MDR32F23QI_RST_CLK_UART_CLOCK */

