piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
/** @defgroup MDR32F23QI_RST_CLK_SSP_CLOCK RST_CLK SSP_CLOCK
 * @{
 */

#define RST_CLK_SSP_CLOCK_SSP_BRG_Pos    0
#define RST_CLK_SSP_CLOCK_SSP_BRG_Msk    (0x7UL << RST_CLK_SSP_CLOCK_SSP_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP_BRG_DIV1   (0x0UL << RST_CLK_SSP_CLOCK_SSP_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP_BRG_DIV2   (0x1UL << RST_CLK_SSP_CLOCK_SSP_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP_BRG_DIV4   (0x2UL << RST_CLK_SSP_CLOCK_SSP_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP_BRG_DIV8   (0x3UL << RST_CLK_SSP_CLOCK_SSP_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP_BRG_DIV16  (0x4UL << RST_CLK_SSP_CLOCK_SSP_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP_BRG_DIV32  (0x5UL << RST_CLK_SSP_CLOCK_SSP_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP_BRG_DIV64  (0x6UL << RST_CLK_SSP_CLOCK_SSP_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP_BRG_DIV128 (0x7UL << RST_CLK_SSP_CLOCK_SSP_BRG_Pos)

#define RST_CLK_SSP_CLOCK_SSP_CLK_EN_Pos 24
#define RST_CLK_SSP_CLOCK_SSP_CLK_EN_Msk (0x1UL << RST_CLK_SSP_CLOCK_SSP_CLK_EN_Pos)
#define RST_CLK_SSP_CLOCK_SSP_CLK_EN     RST_CLK_SSP_CLOCK_SSP_CLK_EN_Msk

/** @} */ /* End of group MDR32F23QI_RST_CLK_SSP_CLOCK */

/** @} */ /* End of group MDR32F23QI_RST_CLK_Defines */

/** @} */ /* End of group MDR32F23QI_RST_CLK */

/** @defgroup MDR32F23QI_ADC MDR_ADC
 * @{
 */

/**
 * @brief MDR32F23QI ADC control structure
 */
typedef struct {
    __IO uint32_t ADC1_CFG;     /*!<ADC1 Configuration Register */
    __IO uint32_t ADC2_CFG;     /*!<ADC2 Configuration Register */
    __IO uint32_t ADC1_H_LEVEL; /*!<ADC1 High Level Register */
    __I uint32_t  RESERVED0;
    __IO uint32_t ADC1_L_LEVEL; /*!<ADC1 Low Level Register */
    __I uint32_t  RESERVED1;
    __IO uint32_t ADC1_RESULT;  /*!<ADC1 Result Register */
    __I uint32_t  RESERVED2;
    __IO uint32_t ADC1_STATUS;  /*!<ADC1 Status Register */
    __I uint32_t  RESERVED3;
    __IO uint32_t ADC1_CHSEL;   /*!<ADC1 Channel Selector Register */
    __I uint32_t  RESERVED4;
    __IO uint32_t ADC1_TRIM;    /*!<ADC Reference Voltage Trim */
} MDR_ADC_TypeDef;

/** @defgroup MDR32F23QI_ADC_Defines ADC Defines
 * @{
 */

/** @defgroup MDR32F23QI_ADC1_CFG ADC1_CFG
 * @{
 */

#define ADC1_CFG_REG_ADON_Pos     0
#define ADC1_CFG_REG_ADON_Msk     (0x1UL << ADC1_CFG_REG_ADON_Pos)
#define ADC1_CFG_REG_ADON         ADC1_CFG_REG_ADON_Msk

#define ADC1_CFG_REG_GO_Pos       1
#define ADC1_CFG_REG_GO_Msk       (0x1UL << ADC1_CFG_REG_GO_Pos)
#define ADC1_CFG_REG_GO           ADC1_CFG_REG_GO_Msk

#define ADC1_CFG_REG_CLKS_Pos     2
#define ADC1_CFG_REG_CLKS_Msk     (0x1UL << ADC1_CFG_REG_CLKS_Pos)
#define ADC1_CFG_REG_CLKS         ADC1_CFG_REG_CLKS_Msk

#define ADC1_CFG_REG_SAMPLE_Pos   3
#define ADC1_CFG_REG_SAMPLE_Msk   (0x1UL << ADC1_CFG_REG_SAMPLE_Pos)
#define ADC1_CFG_REG_SAMPLE       ADC1_CFG_REG_SAMPLE_Msk

#define ADC1_CFG_REG_CHS_Pos      4
#define ADC1_CFG_REG_CHS_Msk      (0x1FUL << ADC1_CFG_REG_CHS_Pos)

#define ADC1_CFG_REG_CHCH_Pos     9
#define ADC1_CFG_REG_CHCH_Msk     (0x1UL << ADC1_CFG_REG_CHCH_Pos)
#define ADC1_CFG_REG_CHCH         ADC1_CFG_REG_CHCH_Msk

#define ADC1_CFG_REG_RNGC_Pos     10
#define ADC1_CFG_REG_RNGC_Msk     (0x1UL << ADC1_CFG_REG_RNGC_Pos)
#define ADC1_CFG_REG_RNGC         ADC1_CFG_REG_RNGC_Msk

#define ADC1_CFG_M_REF_Pos        11
#define ADC1_CFG_M_REF_Msk        (0x1UL << ADC1_CFG_M_REF_Pos)
#define ADC1_CFG_M_REF            ADC1_CFG_M_REF_Msk

#define ADC1_CFG_REG_DIVCLK_Pos   12
#define ADC1_CFG_REG_DIVCLK_Msk   (0xFUL << ADC1_CFG_REG_DIVCLK_Pos)

#define ADC1_CFG_TS_EN_Pos        17
#define ADC1_CFG_TS_EN_Msk        (0x1UL << ADC1_CFG_TS_EN_Pos)
#define ADC1_CFG_TS_EN            ADC1_CFG_TS_EN_Msk

#define ADC1_CFG_TS_BUF_EN_Pos    18
#define ADC1_CFG_TS_BUF_EN_Msk    (0x1UL << ADC1_CFG_TS_BUF_EN_Pos)
#define ADC1_CFG_TS_BUF_EN        ADC1_CFG_TS_BUF_EN_Msk

#define ADC1_CFG_SEL_TS_Pos       19
#define ADC1_CFG_SEL_TS_Msk       (0x1UL << ADC1_CFG_SEL_TS_Pos)
#define ADC1_CFG_SEL_TS           ADC1_CFG_SEL_TS_Msk

#define ADC1_CFG_SEL_VREF_Pos     20
#define ADC1_CFG_SEL_VREF_Msk     (0x1UL << ADC1_CFG_SEL_VREF_Pos)
#define ADC1_CFG_SEL_VREF         ADC1_CFG_SEL_VREF_Msk

#define ADC1_CFG_DELAY_GO_Pos     25
#define ADC1_CFG_DELAY_GO_Msk     (0x7UL << ADC1_CFG_DELAY_GO_Pos)
#define ADC1_CFG_DELAY_GO_PCLKd_0 (0x0UL << ADC1_CFG_DELAY_GO_Pos)
#define ADC1_CFG_DELAY_GO_PCLKd_1 (0x1UL << ADC1_CFG_DELAY_GO_Pos)
#define ADC1_CFG_DELAY_GO_PCLKd_2 (0x2UL << ADC1_CFG_DELAY_GO_Pos)
#define ADC1_CFG_DELAY_GO_PCLKd_3 (0x3UL << ADC1_CFG_DELAY_GO_Pos)
#define ADC1_CFG_DELAY_GO_PCLKd_4 (0x4UL << ADC1_CFG_DELAY_GO_Pos)
#define ADC1_CFG_DELAY_GO_PCLKd_5 (0x5UL << ADC1_CFG_DELAY_GO_Pos)
#define ADC1_CFG_DELAY_GO_PCLKd_6 (0x6UL << ADC1_CFG_DELAY_GO_Pos)
#define ADC1_CFG_DELAY_GO_PCLKd_7 (0x7UL << ADC1_CFG_DELAY_GO_Pos)

#define ADC1_CFG_DELAY_ADC_Pos    28
#define ADC1_CFG_DELAY_ADC_Msk    (0xFUL << ADC1_CFG_DELAY_ADC_Pos)

/** @} */ /* End of group MDR32F23QI_ADC1_CFG */

/** @defgroup MDR32F23QI_ADC2_CFG ADC2_CFG
 * @{
 */

#define ADC2_CFG_ADC1_OP_Pos 17
#define ADC2_CFG_ADC1_OP_Msk (0x1UL << ADC2_CFG_ADC1_OP_Pos)
#define ADC2_CFG_ADC1_OP     ADC2_CFG_ADC1_OP_Msk

/** @} */ /* End of group MDR32F23QI_ADC2_CFG */

/** @defgroup MDR32F23QI_ADC1_H_LEVEL ADC1_H_LEVEL
 * @{
 */

#define ADC1_H_LEVEL_REG_H_LEVEL_Pos 0
#define ADC1_H_LEVEL_REG_H_LEVEL_Msk (0xFFFUL << ADC1_H_LEVEL_REG_H_LEVEL_Pos)

/** @} */ /* End of group MDR32F23QI_ADC1_H_LEVEL */

/** @defgroup MDR32F23QI_ADC1_L_LEVEL ADC1_L_LEVEL
 * @{
 */

#define ADC1_L_LEVEL_REG_L_LEVEL_Pos 0
#define ADC1_L_LEVEL_REG_L_LEVEL_Msk (0xFFFUL << ADC1_L_LEVEL_REG_L_LEVEL_Pos)

/** @} */ /* End of group MDR32F23QI_ADC1_L_LEVEL */

/** @defgroup MDR32F23QI_ADC1_RESULT ADC1_RESULT
 * @{
 */

#define ADC1_RESULT_RESULT_Pos  0
#define ADC1_RESULT_RESULT_Msk  (0xFFFUL << ADC1_RESULT_RESULT_Pos)

#define ADC1_RESULT_CHANNEL_Pos 16
#define ADC1_RESULT_CHANNEL_Msk (0xFFFUL << ADC1_RESULT_CHANNEL_Pos)

/** @} */ /* End of group MDR32F23QI_ADC1_RESULT */

/** @defgroup MDR32F23QI_ADC1_STATUS ADC1_STATUS
 * @{
 */

#define ADC1_STATUS_FLG_REG_OVERWRITE_Pos 0
#define ADC1_STATUS_FLG_REG_OVERWRITE_Msk (0x1UL << ADC1_STATUS_FLG_REG_OVERWRITE_Pos)
#define ADC1_STATUS_FLG_REG_OVERWRITE     ADC1_STATUS_FLG_REG_OVERWRITE_Msk

