piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
#define ADC1_STATUS_FLG_REG_AWOIFEN_Pos   1
#define ADC1_STATUS_FLG_REG_AWOIFEN_Msk   (0x1UL << ADC1_STATUS_FLG_REG_AWOIFEN_Pos)
#define ADC1_STATUS_FLG_REG_AWOIFEN       ADC1_STATUS_FLG_REG_AWOIFEN_Msk

#define ADC1_STATUS_FLG_REG_EOCIF_Pos     2
#define ADC1_STATUS_FLG_REG_EOCIF_Msk     (0x1UL << ADC1_STATUS_FLG_REG_EOCIF_Pos)
#define ADC1_STATUS_FLG_REG_EOCIF         ADC1_STATUS_FLG_REG_EOCIF_Msk

#define ADC1_STATUS_AWOIF_IE_Pos          3
#define ADC1_STATUS_AWOIF_IE_Msk          (0x1UL << ADC1_STATUS_AWOIF_IE_Pos)
#define ADC1_STATUS_AWOIF_IE              ADC1_STATUS_AWOIF_IE_Msk

#define ADC1_STATUS_ECOIF_IE_Pos          4
#define ADC1_STATUS_ECOIF_IE_Msk          (0x1UL << ADC1_STATUS_ECOIF_IE_Pos)
#define ADC1_STATUS_ECOIF_IE              ADC1_STATUS_ECOIF_IE_Msk

/** @} */ /* End of group MDR32F23QI_ADC1_STATUS */

/** @defgroup MDR32F23QI_ADC1_CHSEL ADC1_CHSEL
 * @{
 */

#define ADC1_CHSEL_SL_CH_CH_REF0_Pos  0
#define ADC1_CHSEL_SL_CH_CH_REF0_Msk  (0x1UL << ADC1_CHSEL_SL_CH_CH_REF0_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF0      ADC1_CHSEL_SL_CH_CH_REF0_Msk

#define ADC1_CHSEL_SL_CH_CH_REF1_Pos  1
#define ADC1_CHSEL_SL_CH_CH_REF1_Msk  (0x1UL << ADC1_CHSEL_SL_CH_CH_REF1_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF1      ADC1_CHSEL_SL_CH_CH_REF1_Msk

#define ADC1_CHSEL_SL_CH_CH_REF2_Pos  2
#define ADC1_CHSEL_SL_CH_CH_REF2_Msk  (0x1UL << ADC1_CHSEL_SL_CH_CH_REF2_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF2      ADC1_CHSEL_SL_CH_CH_REF2_Msk

#define ADC1_CHSEL_SL_CH_CH_REF3_Pos  3
#define ADC1_CHSEL_SL_CH_CH_REF3_Msk  (0x1UL << ADC1_CHSEL_SL_CH_CH_REF3_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF3      ADC1_CHSEL_SL_CH_CH_REF3_Msk

#define ADC1_CHSEL_SL_CH_CH_REF4_Pos  4
#define ADC1_CHSEL_SL_CH_CH_REF4_Msk  (0x1UL << ADC1_CHSEL_SL_CH_CH_REF4_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF4      ADC1_CHSEL_SL_CH_CH_REF4_Msk

#define ADC1_CHSEL_SL_CH_CH_REF5_Pos  5
#define ADC1_CHSEL_SL_CH_CH_REF5_Msk  (0x1UL << ADC1_CHSEL_SL_CH_CH_REF5_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF5      ADC1_CHSEL_SL_CH_CH_REF5_Msk

#define ADC1_CHSEL_SL_CH_CH_REF6_Pos  6
#define ADC1_CHSEL_SL_CH_CH_REF6_Msk  (0x1UL << ADC1_CHSEL_SL_CH_CH_REF6_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF6      ADC1_CHSEL_SL_CH_CH_REF6_Msk

#define ADC1_CHSEL_SL_CH_CH_REF7_Pos  7
#define ADC1_CHSEL_SL_CH_CH_REF7_Msk  (0x1UL << ADC1_CHSEL_SL_CH_CH_REF7_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF7      ADC1_CHSEL_SL_CH_CH_REF7_Msk

#define ADC1_CHSEL_SL_CH_CH_REF30_Pos 30
#define ADC1_CHSEL_SL_CH_CH_REF30_Msk (0x1UL << ADC1_CHSEL_SL_CH_CH_REF30_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF30     ADC1_CHSEL_SL_CH_CH_REF30_Msk

#define ADC1_CHSEL_SL_CH_CH_REF31_Pos 31
#define ADC1_CHSEL_SL_CH_CH_REF31_Msk (0x1UL << ADC1_CHSEL_SL_CH_CH_REF31_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF31     ADC1_CHSEL_SL_CH_CH_REF31_Msk

/** @} */ /* End of group MDR32F23QI_ADC1_CHSEL */

/** @defgroup MDR32F23QI_ADC1_TRIM ADC1_TRIM
 * @{
 */

#define ADC1_TRIM_TS_TRIM_Pos      1
#define ADC1_TRIM_TS_TRIM_Msk      (0x1FUL << ADC1_TRIM_TS_TRIM_Pos)

#define ADC1_TRIM_SEL_VREF_BUF_Pos 6
#define ADC1_TRIM_SEL_VREF_BUF_Msk (0x1UL << ADC1_TRIM_SEL_VREF_BUF_Pos)
#define ADC1_TRIM_SEL_VREF_BUF     ADC1_TRIM_SEL_VREF_BUF_Msk

/** @} */ /* End of group MDR32F23QI_ADC1_TRIM */

/** @} */ /* End of group MDR32F23QI_ADC_Defines */

/** @} */ /* End of group MDR32F23QI_ADC */

/** @defgroup MDR32F23QI_WWDG MDR_WWDG
 * @{
 */

/**
 * @brief MDR32F23QI WWDG control structure
 */
typedef struct {
    __IO uint32_t CR;  /*!<WWDG Command Register */
    __IO uint32_t CFR; /*!<WWDG Configuration Register */
    __IO uint32_t SR;  /*!<WWDG Status Register */
} MDR_WWDG_TypeDef;

/** @defgroup MDR32F23QI_IWDG_Defines IWDG Defines
 * @{
 */

/** @defgroup MDR32F23QI_WWDG_CR WWDG_CR
 * @{
 */

#define WWDG_CR_T_Pos    0
#define WWDG_CR_T_Msk    (0x7FUL << WWDG_CR_T_Pos)

#define WWDG_CR_WDGA_Pos 7
#define WWDG_CR_WDGA_Msk (0x1UL << WWDG_CR_WDGA_Pos)
#define WWDG_CR_WDGA     WWDG_CR_WDGA_Msk

/** @} */ /* End of group MDR32F23QI_WWDG_CR */

/** @defgroup MDR32F23QI_WWDG_CFR WWDG CFR
 * @{
 */

#define WWDG_CFR_W_Pos    0
#define WWDG_CFR_W_Msk    (0x7FUL << WWDG_CFR_W_Pos)

#define WWDG_CFR_WGTB_Pos 7
#define WWDG_CFR_WGTB_Msk ((uint32_t)0x3UL << WWDG_CFR_WGTB_Pos)

#define WWDG_CFR_EWI_Pos  9
#define WWDG_CFR_EWI_Msk  ((uint32_t)0x1UL << WWDG_CFR_EWI_Pos)
#define WWDG_CFR_EWI      WWDG_CFR_EWI_Msk

/** @} */ /* End of group MDR32F23QI_WWDG_CFR */

/** @defgroup MDR32F23QI_WWDG_SR WWDG_SR
 * @{
 */

#define WWDG_SR_EWIF_Pos 0
#define WWDG_SR_EWIF_Msk (0x1UL << WWDG_SR_EWIF_Pos)
#define WWDG_SR_EWIF     WWDG_SR_EWIF_Msk

/** @} */ /* End of group MDR32F23QI_WWDG_SR */

/** @} */ /* End of group MDR32F23QI_WWDG_Defines */

/** @} */ /* End of group MDR32F23QI_WWDG */

/** @defgroup MDR32F23QI_IWDG MDR_IWDG
 * @{
 */

/**
 * @brief MDR32F23QI IWDG control structure
 */
typedef struct {
    __IO uint32_t KR;  /*!<IWDG Key Register */
    __IO uint32_t PR;  /*!<IWDG Clock Prescaler Register */
    __IO uint32_t RLR; /*!<IWDG Reload Register */
    __IO uint32_t SR;  /*!<IWDG Status Register */
} MDR_IWDG_TypeDef;

/** @defgroup MDR32F23QI_IWDG_Defines IWDG Defines
 * @{
 */

/** @defgroup MDR32F23QI_IWDG_KR IWDG_KR
 * @{
 */

#define IWDG_KR_KEY_Pos 0
#define IWDG_KR_KEY_Msk (0xFFFFUL << IWDG_KR_KEY_Pos)

/** @} */ /* End of group MDR32F23QI_IWDG_KR */

/** @defgroup MDR32F23QI_IWDG_PR IWDG_PR
 * @{
 */

#define IWDG_PR_PR_Pos    0
#define IWDG_PR_PR_Msk    (0x7UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV4   (0x0UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV8   (0x1UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV16  (0x2UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV32  (0x3UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV64  (0x4UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV128 (0x5UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV256 (0x6UL << IWDG_PR_PR_Pos)

/** @} */ /* End of group MDR32F23QI_IWDG_PR */

/** @defgroup MDR32F23QI_IWDG_RLR IWDG_RLR
 * @{
 */

#define IWDG_RLR_RLR_Pos 0
#define IWDG_RLR_RLR_Msk (0xFFFUL << IWDG_RLR_RLR_Pos)

/** @} */ /* End of group MDR32F23QI_IWDG_RLR */

/** @defgroup MDR32F23QI_IWDG_SR IWDG_SR
 * @{
 */

#define IWDG_SR_PVU_Pos 0
#define IWDG_SR_PVU_Msk (0x1UL << IWDG_SR_PVU_Pos)
#define IWDG_SR_PVU     IWDG_SR_PVU_Msk

#define IWDG_SR_RVU_Pos 1
#define IWDG_SR_RVU_Msk (0x1UL << IWDG_SR_RVU_Pos)
#define IWDG_SR_RVU     IWDG_SR_RVU_Msk

/** @} */ /* End of group MDR32F23QI_IWDG_SR */

/** @} */ /* End of group MDR32F23QI_IWDG_Defines */

