piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
/** @} */ /* End of group MDR32F23QI_IWDG */

/** @defgroup MDR32F23QI_POWER MDR_POWER
 * @{
 */

/**
 * @brief MDR32F23QI POWER control structure
 */
typedef struct {
    __IO uint32_t PVDCS; /*!<POWER Power Detector Control/Status Register */
} MDR_POWER_TypeDef;

/** @defgroup MDR32F23QI_POWER_Defines POWER Defines
 * @{
 */

/** @defgroup MDR32F23QI_POWER_PVDCS POWER_PVDCS
 * @{
 */

#define POWER_PVDCS_PVDEN_Pos  0
#define POWER_PVDCS_PVDEN_Msk  (0x1UL << POWER_PVDCS_PVDEN_Pos)
#define POWER_PVDCS_PVDEN      POWER_PVDCS_PVDEN_Msk

#define POWER_PVDCS_PBLS_Pos   1
#define POWER_PVDCS_PBLS_Msk   (0xFUL << POWER_PVDCS_PBLS_Pos)

#define POWER_PVDCS_PLS_Pos    5
#define POWER_PVDCS_PLS_Msk    (0xFUL << POWER_PVDCS_PLS_Pos)

#define POWER_PVDCS_PVBD_Pos   9
#define POWER_PVDCS_PVBD_Msk   (0x1UL << POWER_PVDCS_PVBD_Pos)
#define POWER_PVDCS_PVBD       POWER_PVDCS_PVBD_Msk

#define POWER_PVDCS_PVD_Pos    10
#define POWER_PVDCS_PVD_Msk    (0x1UL << POWER_PVDCS_PVD_Pos)
#define POWER_PVDCS_PVD        POWER_PVDCS_PVD_Msk

#define POWER_PVDCS_IEPVBD_Pos 11
#define POWER_PVDCS_IEPVBD_Msk (0x1UL << POWER_PVDCS_IEPVBD_Pos)
#define POWER_PVDCS_IEPVBD     POWER_PVDCS_IEPVBD_Msk

#define POWER_PVDCS_IEPVD_Pos  12
#define POWER_PVDCS_IEPVD_Msk  (0x1UL << POWER_PVDCS_IEPVD_Pos)
#define POWER_PVDCS_IEPVD      POWER_PVDCS_IEPVD_Msk

#define POWER_PVDCS_INVB_Pos   13
#define POWER_PVDCS_INVB_Msk   (0x1UL << POWER_PVDCS_INVB_Pos)
#define POWER_PVDCS_INVB       POWER_PVDCS_INVB_Msk

#define POWER_PVDCS_INV_Pos    14
#define POWER_PVDCS_INV_Msk    (0x1UL << POWER_PVDCS_INV_Pos)
#define POWER_PVDCS_INV        POWER_PVDCS_INV_Msk

#define POWER_PVDCS_PVDBEN_Pos 15
#define POWER_PVDCS_PVDBEN_Msk (0x1UL << POWER_PVDCS_PVDBEN_Pos)
#define POWER_PVDCS_PVDBEN     POWER_PVDCS_PVDBEN_Msk

/** @} */ /* End of group MDR32F23QI_POWER_Defines */

/** @} */ /* End of group MDR32F23QI_POWER_PVDCS */

/** @} */ /* End of group MDR32F23QI_POWER */

/** @defgroup MDR32F23QI_BKP MDR_BKP
 * @{
 */

/**
 * @brief MDR32F23QI BKP and RTC control structure
 */
typedef struct {
    __IO uint32_t REG_00;   /*!<BKP Register 0 */
    __IO uint32_t REG_01;   /*!<BKP Register 1 */
    __IO uint32_t REG_02;   /*!<BKP Register 2 */
    __IO uint32_t REG_03;   /*!<BKP Register 3 */
    __IO uint32_t REG_04;   /*!<BKP Register 4 */
    __IO uint32_t REG_05;   /*!<BKP Register 5 */
    __IO uint32_t REG_06;   /*!<BKP Register 6 */
    __IO uint32_t REG_07;   /*!<BKP Register 7 */
    __IO uint32_t REG_08;   /*!<BKP Register 8 */
    __IO uint32_t REG_09;   /*!<BKP Register 9 */
    __IO uint32_t REG_0A;   /*!<BKP Register 10 */
    __IO uint32_t REG_0B;   /*!<BKP Register 11 */
    __IO uint32_t REG_0C;   /*!<BKP Register 12 */
    __IO uint32_t REG_0D;   /*!<BKP Register 13 */
    __IO uint32_t REG_0E;   /*!<BKP Register 14 (PSS Control Register) */
    __IO uint32_t REG_0F;   /*!<BKP Register 15 (RTC & Generator Control Register) */
    __IO uint32_t RTC_CNT;  /*!<RTC Counter Register */
    __IO uint32_t RTC_DIV;  /*!<RTC Prescaler Counter Register */
    __IO uint32_t RTC_PRL;  /*!<RTC Prescaler Reload Value Register */
    __IO uint32_t RTC_ALRM; /*!<RTC Alarm Register */
    __IO uint32_t RTC_CS;   /*!<RTC Control and Status Register */
} MDR_BKP_TypeDef;

/** @defgroup MDR32F23QI_BKP_Defines BKP Defines
 * @{
 */

/** @defgroup MDR32F23QI_BKP_REG_00 BKP_REG_00
 * @{
 */

#define BKP_REG_00_BKP_REG_Pos 0
#define BKP_REG_00_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_00_BKP_REG_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_REG_00 */

/** @defgroup MDR32F23QI_BKP_REG_01 BKP_REG_01
 * @{
 */

#define BKP_REG_01_BKP_REG_Pos 0
#define BKP_REG_01_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_01_BKP_REG_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_REG_01 */

/** @defgroup MDR32F23QI_BKP_REG_02 BKP_REG_02
 * @{
 */

#define BKP_REG_02_BKP_REG_Pos 0
#define BKP_REG_02_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_02_BKP_REG_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_REG_02 */

/** @defgroup MDR32F23QI_BKP_REG_03 BKP_REG_03
 * @{
 */

#define BKP_REG_03_BKP_REG_Pos 0
#define BKP_REG_03_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_03_BKP_REG_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_REG_03 */

/** @defgroup MDR32F23QI_BKP_REG_04 BKP_REG_04
 * @{
 */

#define BKP_REG_04_BKP_REG_Pos 0
#define BKP_REG_04_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_04_BKP_REG_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_REG_04 */

/** @defgroup MDR32F23QI_BKP_REG_05 BKP_REG_05
 * @{
 */

#define BKP_REG_05_BKP_REG_Pos 0
#define BKP_REG_05_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_05_BKP_REG_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_REG_05 */

/** @defgroup MDR32F23QI_BKP_REG_06 BKP_REG_06
 * @{
 */

#define BKP_REG_06_BKP_REG_Pos 0
#define BKP_REG_06_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_06_BKP_REG_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_REG_06 */

/** @defgroup MDR32F23QI_BKP_REG_07 BKP_REG_07
 * @{
 */

#define BKP_REG_07_BKP_REG_Pos 0
#define BKP_REG_07_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_07_BKP_REG_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_REG_07 */

/** @defgroup MDR32F23QI_BKP_REG_08 BKP_REG_08
 * @{
 */

#define BKP_REG_08_BKP_REG_Pos 0
#define BKP_REG_08_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_08_BKP_REG_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_REG_08 */

/** @defgroup MDR32F23QI_BKP_REG_09 BKP_REG_09
 * @{
 */

#define BKP_REG_09_BKP_REG_Pos 0
#define BKP_REG_09_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_09_BKP_REG_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_REG_09 */

/** @defgroup MDR32F23QI_BKP_REG_0A BKP_REG_0A
 * @{
 */

#define BKP_REG_0A_BKP_REG_Pos 0
#define BKP_REG_0A_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_0A_BKP_REG_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_REG_0A */

/** @defgroup MDR32F23QI_BKP_REG_0B BKP_REG_0B
 * @{
 */

#define BKP_REG_0B_BKP_REG_Pos 0
#define BKP_REG_0B_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_0B_BKP_REG_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_REG_0B */

/** @defgroup MDR32F23QI_BKP_REG_0C BKP_REG_0C
 * @{
 */

#define BKP_REG_0C_BKP_REG_Pos 0
#define BKP_REG_0C_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_0C_BKP_REG_Pos)

