piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
/** @} */ /* End of group MDR32F23QI_BKP_REG_0C */

/** @defgroup MDR32F23QI_BKP_REG_0D BKP_REG_0D
 * @{
 */

#define BKP_REG_0D_BKP_REG_Pos 0
#define BKP_REG_0D_BKP_REG_Msk (0xFFFFFFFFUL << BKP_REG_0D_BKP_REG_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_REG_0D */

/** @defgroup MDR32F23QI_BKP_REG_0E BKP_REG_0E
 * @{
 */

#define BKP_REG_0E_LOW_Pos             0
#define BKP_REG_0E_LOW_Msk             (0x7UL << BKP_REG_0E_LOW_Pos)
#define BKP_REG_0E_LOW_CLK_UPTO_10MHz  (0x0UL << BKP_REG_0E_LOW_Pos)
#define BKP_REG_0E_LOW_CLK_UPTO_200kHz (0x1UL << BKP_REG_0E_LOW_Pos)
#define BKP_REG_0E_LOW_CLK_UPTO_500kHz (0x2UL << BKP_REG_0E_LOW_Pos)
#define BKP_REG_0E_LOW_CLK_UPTO_1MHz   (0x3UL << BKP_REG_0E_LOW_Pos)
#define BKP_REG_0E_LOW_CLK_OFF         (0x4UL << BKP_REG_0E_LOW_Pos)
#define BKP_REG_0E_LOW_CLK_UPTO_40MHz  (0x5UL << BKP_REG_0E_LOW_Pos)
#define BKP_REG_0E_LOW_CLK_UPTO_80MHz  (0x6UL << BKP_REG_0E_LOW_Pos)
#define BKP_REG_0E_LOW_CLK_OVER_80MHz  (0x7UL << BKP_REG_0E_LOW_Pos)

#define BKP_REG_0E_SELECTRI_Pos        3
#define BKP_REG_0E_SELECTRI_Msk        (0x7UL << BKP_REG_0E_SELECTRI_Pos)
#define BKP_REG_0E_SELECTRI_LOAD_6k    (0x0UL << BKP_REG_0E_SELECTRI_Pos)
#define BKP_REG_0E_SELECTRI_LOAD_270k  (0x1UL << BKP_REG_0E_SELECTRI_Pos)
#define BKP_REG_0E_SELECTRI_LOAD_90k   (0x2UL << BKP_REG_0E_SELECTRI_Pos)
#define BKP_REG_0E_SELECTRI_LOAD_24k   (0x3UL << BKP_REG_0E_SELECTRI_Pos)
#define BKP_REG_0E_SELECTRI_LOAD_900k  (0x4UL << BKP_REG_0E_SELECTRI_Pos)
#define BKP_REG_0E_SELECTRI_LOAD_2k    (0x5UL << BKP_REG_0E_SELECTRI_Pos)
#define BKP_REG_0E_SELECTRI_LOAD_400   (0x6UL << BKP_REG_0E_SELECTRI_Pos)
#define BKP_REG_0E_SELECTRI_LOAD_100   (0x7UL << BKP_REG_0E_SELECTRI_Pos)

#define BKP_REG_0E_SW_EN_Pos           6
#define BKP_REG_0E_SW_EN_Msk           (0x3UL << BKP_REG_0E_SW_EN_Pos)
#define BKP_REG_0E_SW_EN_SW_DISABLED   (0x0UL << BKP_REG_0E_SW_EN_Pos)
#define BKP_REG_0E_SW_EN_SW_ENABLED_1  (0x1UL << BKP_REG_0E_SW_EN_Pos)
#define BKP_REG_0E_SW_EN_SW_ENABLED_2  (0x2UL << BKP_REG_0E_SW_EN_Pos)

#define BKP_REG_0E_TRIM20_Pos          8
#define BKP_REG_0E_TRIM20_Msk          (0x7UL << BKP_REG_0E_TRIM20_Pos)
#define BKP_REG_0E_TRIM20_PLUS_100mV   (0x0UL << BKP_REG_0E_TRIM20_Pos)
#define BKP_REG_0E_TRIM20_PLUS_060mV   (0x1UL << BKP_REG_0E_TRIM20_Pos)
#define BKP_REG_0E_TRIM20_PLUS_040mV   (0x2UL << BKP_REG_0E_TRIM20_Pos)
#define BKP_REG_0E_TRIM20_PLUS_010mV   (0x3UL << BKP_REG_0E_TRIM20_Pos)
#define BKP_REG_0E_TRIM20_MINUS_010mV  (0x4UL << BKP_REG_0E_TRIM20_Pos)
#define BKP_REG_0E_TRIM20_MINUS_040mV  (0x5UL << BKP_REG_0E_TRIM20_Pos)
#define BKP_REG_0E_TRIM20_MINUS_060mV  (0x6UL << BKP_REG_0E_TRIM20_Pos)
#define BKP_REG_0E_TRIM20_MINUS_100mV  (0x7UL << BKP_REG_0E_TRIM20_Pos)

#define BKP_REG_0E_FPOR_Pos            11
#define BKP_REG_0E_FPOR_Msk            (0x1UL << BKP_REG_0E_FPOR_Pos)
#define BKP_REG_0E_FPOR                BKP_REG_0E_FPOR_Msk

#define BKP_REG_0E_TRIM43_Pos          12
#define BKP_REG_0E_TRIM43_Msk          (0x3UL << BKP_REG_0E_TRIM43_Pos)
#define BKP_REG_0E_TRIM43_1p8V         (0x0UL << BKP_REG_0E_TRIM43_Pos)
#define BKP_REG_0E_TRIM43_1p6V         (0x1UL << BKP_REG_0E_TRIM43_Pos)
#define BKP_REG_0E_TRIM43_1p4V         (0x2UL << BKP_REG_0E_TRIM43_Pos)
#define BKP_REG_0E_TRIM43_1p2V         (0x3UL << BKP_REG_0E_TRIM43_Pos)

#define BKP_REG_0E_COV_DET_Pos         14
#define BKP_REG_0E_COV_DET_Msk         (0x1UL << BKP_REG_0E_COV_DET_Pos)
#define BKP_REG_0E_COV_DET             BKP_REG_0E_COV_DET_Msk

#define BKP_REG_0E_ILIMEN_Pos          15
#define BKP_REG_0E_ILIMEN_Msk          (0x1UL << BKP_REG_0E_ILIMEN_Pos)
#define BKP_REG_0E_ILIMEN              BKP_REG_0E_ILIMEN_Msk

/** @} */ /* End of group MDR32F23QI_BKP_REG_0E */

/** @defgroup MDR32F23QI_BKP_REG_0F BKP_REG_0F
 * @{
 */

#define BKP_REG_0F_LSE_ON_Pos      0
#define BKP_REG_0F_LSE_ON_Msk      (0x1UL << BKP_REG_0F_LSE_ON_Pos)
#define BKP_REG_0F_LSE_ON          BKP_REG_0F_LSE_ON_Msk

#define BKP_REG_0F_LSE_BYP_Pos     1
#define BKP_REG_0F_LSE_BYP_Msk     (0x1UL << BKP_REG_0F_LSE_BYP_Pos)
#define BKP_REG_0F_LSE_BYP         BKP_REG_0F_LSE_BYP_Msk

#define BKP_REG_0F_RTC_SEL_Pos     2
#define BKP_REG_0F_RTC_SEL_Msk     (0x3UL << BKP_REG_0F_RTC_SEL_Pos)
#define BKP_REG_0F_RTC_SEL_LSI     (0x0UL << BKP_REG_0F_RTC_SEL_Pos)
#define BKP_REG_0F_RTC_SEL_LSE     (0x1UL << BKP_REG_0F_RTC_SEL_Pos)
#define BKP_REG_0F_RTC_SEL_HSI_RTC (0x2UL << BKP_REG_0F_RTC_SEL_Pos)
#define BKP_REG_0F_RTC_SEL_HSE_RTC (0x3UL << BKP_REG_0F_RTC_SEL_Pos)

#define BKP_REG_0F_RTC_EN_Pos      4
#define BKP_REG_0F_RTC_EN_Msk      (0x1UL << BKP_REG_0F_RTC_EN_Pos)
#define BKP_REG_0F_RTC_EN          BKP_REG_0F_RTC_EN_Msk

#define BKP_REG_0F_RTC_CAL_Pos     5
#define BKP_REG_0F_RTC_CAL_Msk     (0xFFUL << BKP_REG_0F_RTC_CAL_Pos)

#define BKP_REG_0F_LSE_RDY_Pos     13
#define BKP_REG_0F_LSE_RDY_Msk     (0x1UL << BKP_REG_0F_LSE_RDY_Pos)
#define BKP_REG_0F_LSE_RDY         BKP_REG_0F_LSE_RDY_Msk

#define BKP_REG_0F_LSI_ON_Pos      15
#define BKP_REG_0F_LSI_ON_Msk      (0x1UL << BKP_REG_0F_LSI_ON_Pos)
#define BKP_REG_0F_LSI_ON          BKP_REG_0F_LSI_ON_Msk

#define BKP_REG_0F_LSI_TRIM_Pos    16
#define BKP_REG_0F_LSI_TRIM_Msk    (0x1FUL << BKP_REG_0F_LSI_TRIM_Pos)

#define BKP_REG_0F_LSI_RDY_Pos     21
#define BKP_REG_0F_LSI_RDY_Msk     (0x1UL << BKP_REG_0F_LSI_RDY_Pos)
#define BKP_REG_0F_LSI_RDY         BKP_REG_0F_LSI_RDY_Msk

#define BKP_REG_0F_HSI_ON_Pos      22
#define BKP_REG_0F_HSI_ON_Msk      (0x1UL << BKP_REG_0F_HSI_ON_Pos)
#define BKP_REG_0F_HSI_ON          BKP_REG_0F_HSI_ON_Msk

#define BKP_REG_0F_HSI_RDY_Pos     23
#define BKP_REG_0F_HSI_RDY_Msk     (0x1UL << BKP_REG_0F_HSI_RDY_Pos)
#define BKP_REG_0F_HSI_RDY         BKP_REG_0F_HSI_RDY_Msk

#define BKP_REG_0F_HSI_TRIM_Pos    24
#define BKP_REG_0F_HSI_TRIM_Msk    (0x3FUL << BKP_REG_0F_HSI_TRIM_Pos)

#define BKP_REG_0F_STANDBY_Pos     30
#define BKP_REG_0F_STANDBY_Msk     (0x1UL << BKP_REG_0F_STANDBY_Pos)
#define BKP_REG_0F_STANDBY         BKP_REG_0F_STANDBY_Msk

#define BKP_REG_0F_RTC_RESET_Pos   31
#define BKP_REG_0F_RTC_RESET_Msk   (0x1UL << BKP_REG_0F_RTC_RESET_Pos)
#define BKP_REG_0F_RTC_RESET       BKP_REG_0F_RTC_RESET_Msk

/** @} */ /* End of group MDR32F23QI_BKP_REG_0F */

/** @defgroup MDR32F23QI_BKP_RTC_CNT BKP_RTC_CNT
 * @{
 */

#define BKP_RTC_CNT_RTC_CNT_Pos 0
#define BKP_RTC_CNT_RTC_CNT_Msk (0xFFFFFFFFUL << BKP_RTC_CNT_RTC_CNT_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_RTC_CNT */

/** @defgroup MDR32F23QI_BKP_RTC_DIV BKP_RTC_DIV
 * @{
 */

#define BKP_RTC_DIV_RTC_DIV_Pos 0
#define BKP_RTC_DIV_RTC_DIV_Msk (0xFFFFFUL << BKP_RTC_DIV_RTC_DIV_Pos)

