piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
/** @} */ /* End of group MDR32F23QI_BKP_RTC_DIV */

/** @defgroup MDR32F23QI_BKP_RTC_PRL BKP_RTC_PRL
 * @{
 */

#define BKP_RTC_PRL_RTC_PRL_Pos 0
#define BKP_RTC_PRL_RTC_PRL_Msk (0xFFFFFUL << BKP_RTC_PRL_RTC_PRL_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_RTC_PRL */

/** @defgroup MDR32F23QI_BKP_RTC_ALRM BKP_RTC_ALRM
 * @{
 */

#define BKP_RTC_ALRM_RTC_ALRM_Pos 0
#define BKP_RTC_ALRM_RTC_ALRM_Msk (0xFFFFFFFFUL << BKP_RTC_ALRM_RTC_ALRM_Pos)

/** @} */ /* End of group MDR32F23QI_BKP_RTC_ALRM */

/** @defgroup MDR32F23QI_BKP_RTC_CS BKP_RTC_CS
 * @{
 */

#define BKP_RTC_CS_OWF_Pos     0
#define BKP_RTC_CS_OWF_Msk     (0x1UL << BKP_RTC_CS_OWF_Pos)
#define BKP_RTC_CS_OWF         BKP_RTC_CS_OWF_Msk

#define BKP_RTC_CS_SECF_Pos    1
#define BKP_RTC_CS_SECF_Msk    (0x1UL << BKP_RTC_CS_SECF_Pos)
#define BKP_RTC_CS_SECF        BKP_RTC_CS_SECF_Msk

#define BKP_RTC_CS_ALRF_Pos    2
#define BKP_RTC_CS_ALRF_Msk    (0x1UL << BKP_RTC_CS_ALRF_Pos)
#define BKP_RTC_CS_ALRF        BKP_RTC_CS_ALRF_Msk

#define BKP_RTC_CS_OWF_IE_Pos  3
#define BKP_RTC_CS_OWF_IE_Msk  (0x1UL << BKP_RTC_CS_OWF_IE_Pos)
#define BKP_RTC_CS_OWF_IE      BKP_RTC_CS_OWF_IE_Msk

#define BKP_RTC_CS_SECF_IE_Pos 4
#define BKP_RTC_CS_SECF_IE_Msk (0x1UL << BKP_RTC_CS_SECF_IE_Pos)
#define BKP_RTC_CS_SECF_IE     BKP_RTC_CS_SECF_IE_Msk

#define BKP_RTC_CS_ALRF_IE_Pos 5
#define BKP_RTC_CS_ALRF_IE_Msk (0x1UL << BKP_RTC_CS_ALRF_IE_Pos)
#define BKP_RTC_CS_ALRF_IE     BKP_RTC_CS_ALRF_IE_Msk

#define BKP_RTC_CS_WEC_Pos     6
#define BKP_RTC_CS_WEC_Msk     (0x1UL << BKP_RTC_CS_WEC_Pos)
#define BKP_RTC_CS_WEC         BKP_RTC_CS_WEC_Msk

/** @} */ /* End of group MDR32F23QI_BKP_RTC_CS */

/** @} */ /* End of group MDR32F23QI_BKP_Defines */

/** @} */ /* End of group MDR32F23QI_BKP */

/** @defgroup MDR32F23QI_ADCUI ADCUI
 * @{
 */

/**
 * @brief MDR32F23QI ADCUI control structure
 */
typedef struct {
    __IO uint32_t CTRL1;   /*!<ADCUI General Control1 Register */
    __IO uint32_t CTRL2;   /*!<ADCUI General control2 Register */
    __IO uint32_t CTRL3;   /*!<ADCUI General Control3 Register */
    __IO uint32_t F0CTR;   /*!<ADCUI Control Register for channel F0 */
    __IO uint32_t F0WC;    /*!<ADCUI Active Power Calculation Control Register for Channel F0 */
    __IO uint32_t F0WATTP; /*!<ADCUI Positive Active Power Value Register for Channel F0 */
    __IO uint32_t F0WATTN; /*!<ADCUI Negative Active Power Value Register for Channel F0 */
    __IO uint32_t F0VC;    /*!<ADCUI Reactive Power Calculation Control Register for Channel F0 */
    __IO uint32_t F0VARP;  /*!<ADCUI Positive Reactive Power Value Register for Channel F0 */
    __IO uint32_t F0VARN;  /*!<ADCUI Negative Reactive Power Value Register for Channel F0 */
    __IO uint32_t F0AC;    /*!<ADCUI Apparent Power Calculation Control Register for Channel F0 */
    __IO uint32_t F0VR;    /*!<ADCUI Apparent Power Value Register for Channel F0 */
    __IO uint32_t F0MD0;   /*!<ADCUI Parameters0 Register for Channel F0 */
    __IO uint32_t F0MD1;   /*!<ADCUI Parameters1 Register for Channel F0 */
    __IO uint32_t F0VPEAK; /*!<ADCUI Register of Peak Value in Voltage Channel in Channel F0 */
    __IO uint32_t F0IPEAK; /*!<ADCUI Register of Peak Calue in Current Channel in Channel F0 */
    __IO uint32_t F0VDAT;  /*!<ADCUI Voltage Register V0 for Channel F0 */
    __IO uint32_t F0I0DAT; /*!<ADCUI Current Register I0 for Channel F0 */
    __IO uint32_t F0I3DAT; /*!<ADCUI Current Register I3 for Channel F0 */
    __IO uint32_t F0VRMS;  /*!<ADCUI RMS Value Channel Voltage F0 Register */
    __IO uint32_t F0VRMS2; /*!<ADCUI RMS Squared in F0 Voltage Channel Register */
    __IO uint32_t F0IRMS;  /*!<ADCUI RMS Current Channel F0 Register */
    __IO uint32_t F0IRMS2; /*!<ADCUI RMS Squared in Current Channel F0 Register */
    __IO uint32_t F0STAT;  /*!<ADCUI Channel status F0 Register */
    __IO uint32_t F0MASK;  /*!<ADCUI F0 Channel Interrupt Mask */
    __IO uint32_t RESERVED0[44];
    __IO uint32_t CCAL1;   /*!<ADCUI Current Channel Calibration Register 1 */
    __IO uint32_t RESERVED1[2];
    __IO uint32_t CCAL4;   /*!<ADCUI Current Channel Calibration Register 4 */
} MDR_ADCUI_TypeDef;

/** @defgroup MDR32F23QI_ADCUI_Defines ADCUI Defines
 * @{
 */

/** @defgroup MDR32F23QI_ADCUI_CTRL1 ADCUI_CTRL1
 * @{
 */

#define ADCUI_CTRL1_I0EN_Pos             0
#define ADCUI_CTRL1_I0EN_Msk             (0x1UL << ADCUI_CTRL1_I0EN_Pos)
#define ADCUI_CTRL1_I0EN                 ADCUI_CTRL1_I0EN_Msk

#define ADCUI_CTRL1_V0EN_Pos             1
#define ADCUI_CTRL1_V0EN_Msk             (0x1UL << ADCUI_CTRL1_V0EN_Pos)
#define ADCUI_CTRL1_V0EN                 ADCUI_CTRL1_V0EN_Msk

#define ADCUI_CTRL1_I3EN_Pos             6
#define ADCUI_CTRL1_I3EN_Msk             (0x1UL << ADCUI_CTRL1_I3EN_Pos)
#define ADCUI_CTRL1_I3EN                 ADCUI_CTRL1_I3EN_Msk

#define ADCUI_CTRL1_RESOL_Pos            7
#define ADCUI_CTRL1_RESOL_Msk            (0x1UL << ADCUI_CTRL1_RESOL_Pos)
#define ADCUI_CTRL1_RESOL                ADCUI_CTRL1_RESOL_Msk

#define ADCUI_CTRL1_ZXLPF_Pos            8
#define ADCUI_CTRL1_ZXLPF_Msk            (0x1UL << ADCUI_CTRL1_ZXLPF_Pos)
#define ADCUI_CTRL1_ZXLPF                ADCUI_CTRL1_ZXLPF_Msk

#define ADCUI_CTRL1_PER_LENGHT_Pos       9
#define ADCUI_CTRL1_PER_LENGHT_Msk       (0x7UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_1         (0x0UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_2         (0x1UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_4         (0x2UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_8         (0x3UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_16        (0x4UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_32        (0x5UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_64        (0x6UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_128       (0x7UL << ADCUI_CTRL1_PER_LENGHT_Pos)

#define ADCUI_CTRL1_APNOLOAD_Pos         12
#define ADCUI_CTRL1_APNOLOAD_Msk         (0x3UL << ADCUI_CTRL1_APNOLOAD_Pos)
#define ADCUI_CTRL1_APNOLOAD_FULL        (0x0UL << ADCUI_CTRL1_APNOLOAD_Pos)
#define ADCUI_CTRL1_APNOLOAD_0p012pct    (0x1UL << ADCUI_CTRL1_APNOLOAD_Pos)
#define ADCUI_CTRL1_APNOLOAD_0p0061pct   (0x2UL << ADCUI_CTRL1_APNOLOAD_Pos)
#define ADCUI_CTRL1_APNOLOAD_0p00305pct  (0x3UL << ADCUI_CTRL1_APNOLOAD_Pos)

#define ADCUI_CTRL1_VARNOLOAD_Pos        15
#define ADCUI_CTRL1_VARNOLOAD_Msk        (0x3UL << ADCUI_CTRL1_VARNOLOAD_Pos)
#define ADCUI_CTRL1_VARNOLOAD_FULL       (0x0UL << ADCUI_CTRL1_VARNOLOAD_Pos)
#define ADCUI_CTRL1_VARNOLOAD_0p012pct   (0x1UL << ADCUI_CTRL1_VARNOLOAD_Pos)
#define ADCUI_CTRL1_VARNOLOAD_0p0061pct  (0x2UL << ADCUI_CTRL1_VARNOLOAD_Pos)
#define ADCUI_CTRL1_VARNOLOAD_0p00305pct (0x3UL << ADCUI_CTRL1_VARNOLOAD_Pos)

