piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
#define ADCUI_CTRL1_VANOLOAD_Pos         17
#define ADCUI_CTRL1_VANOLOAD_Msk         (0x3UL << ADCUI_CTRL1_VANOLOAD_Pos)
#define ADCUI_CTRL1_VANOLOAD_FULL        (0x0UL << ADCUI_CTRL1_VANOLOAD_Pos)
#define ADCUI_CTRL1_VANOLOAD_0p012pct    (0x1UL << ADCUI_CTRL1_VANOLOAD_Pos)
#define ADCUI_CTRL1_VANOLOAD_0p0061pct   (0x2UL << ADCUI_CTRL1_VANOLOAD_Pos)
#define ADCUI_CTRL1_VANOLOAD_0p00305pct  (0x3UL << ADCUI_CTRL1_VANOLOAD_Pos)

#define ADCUI_CTRL1_FREQSEL_Pos          19
#define ADCUI_CTRL1_FREQSEL_Msk          (0x1UL << ADCUI_CTRL1_FREQSEL_Pos)
#define ADCUI_CTRL1_FREQSEL              ADCUI_CTRL1_FREQSEL_Msk

#define ADCUI_CTRL1_VREF_SEL_Pos         20
#define ADCUI_CTRL1_VREF_SEL_Msk         (0x1UL << ADCUI_CTRL1_VREF_SEL_Pos)
#define ADCUI_CTRL1_VREF_SEL             ADCUI_CTRL1_VREF_SEL_Msk

#define ADCUI_CTRL1_BUF_BYP_Pos          21
#define ADCUI_CTRL1_BUF_BYP_Msk          (0x1UL << ADCUI_CTRL1_BUF_BYP_Pos)
#define ADCUI_CTRL1_BUF_BYP              ADCUI_CTRL1_BUF_BYP_Msk

#define ADCUI_CTRL1_ZXRMS_Pos            27
#define ADCUI_CTRL1_ZXRMS_Msk            (0x1UL << ADCUI_CTRL1_ZXRMS_Pos)
#define ADCUI_CTRL1_ZXRMS                ADCUI_CTRL1_ZXRMS_Msk

#define ADCUI_CTRL1_RESET_DIG_Pos        28
#define ADCUI_CTRL1_RESET_DIG_Msk        (0x1UL << ADCUI_CTRL1_RESET_DIG_Pos)
#define ADCUI_CTRL1_RESET_DIG            ADCUI_CTRL1_RESET_DIG_Msk

#define ADCUI_CTRL1_IBOOST_Pos           29
#define ADCUI_CTRL1_IBOOST_Msk           (0x1UL << ADCUI_CTRL1_IBOOST_Pos)
#define ADCUI_CTRL1_IBOOST               ADCUI_CTRL1_IBOOST_Msk

#define ADCUI_CTRL1_OSR_CONF_Pos         30
#define ADCUI_CTRL1_OSR_CONF_Msk         (0x3UL << ADCUI_CTRL1_OSR_CONF_Pos)
#define ADCUI_CTRL1_OSR_CONF_256_4kHz    (0x0UL << ADCUI_CTRL1_OSR_CONF_Pos)
#define ADCUI_CTRL1_OSR_CONF_128_8kHz    (0x1UL << ADCUI_CTRL1_OSR_CONF_Pos)
#define ADCUI_CTRL1_OSR_CONF_64_16kHz    (0x2UL << ADCUI_CTRL1_OSR_CONF_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_CTRL1 */

/** @defgroup MDR32F23QI_ADCUI_CTRL2 ADCUI_CTRL2
 * @{
 */

#define ADCUI_CTRL2_SAGLVL_Pos 0
#define ADCUI_CTRL2_SAGLVL_Msk (0xFFFFUL << ADCUI_CTRL2_SAGLVL_Pos)

#define ADCUI_CTRL2_SAGCYC_Pos 16
#define ADCUI_CTRL2_SAGCYC_Msk (0xFFUL << ADCUI_CTRL2_SAGCYC_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_CTRL2 */

/** @defgroup MDR32F23QI_ADCUI_CTRL3 ADCUI_CTRL3
 * @{
 */

#define ADCUI_CTRL3_ZXTOUT_Pos 0
#define ADCUI_CTRL3_ZXTOUT_Msk (0xFFFUL << ADCUI_CTRL3_ZXTOUT_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_CTRL3 */

/** @defgroup MDR32F23QI_ADCUI_F0CTR ADCUI_F0CTR
 * @{
 */

#define ADCUI_F0CTR_F0I0NTEN_Pos  0
#define ADCUI_F0CTR_F0I0NTEN_Msk  (0x1UL << ADCUI_F0CTR_F0I0NTEN_Pos)
#define ADCUI_F0CTR_F0I0NTEN      ADCUI_F0CTR_F0I0NTEN_Msk

#define ADCUI_F0CTR_F0I3NTEN_Pos  1
#define ADCUI_F0CTR_F0I3NTEN_Msk  (0x1UL << ADCUI_F0CTR_F0I3NTEN_Pos)
#define ADCUI_F0CTR_F0I3NTEN      ADCUI_F0CTR_F0I3NTEN_Msk

#define ADCUI_F0CTR_F0VASEL_Pos   2
#define ADCUI_F0CTR_F0VASEL_Msk   (0x1UL << ADCUI_F0CTR_F0VASEL_Pos)
#define ADCUI_F0CTR_F0VASEL       ADCUI_F0CTR_F0VASEL_Msk

#define ADCUI_F0CTR_F0RARS_Pos    3
#define ADCUI_F0CTR_F0RARS_Msk    (0x1UL << ADCUI_F0CTR_F0RARS_Pos)
#define ADCUI_F0CTR_F0RARS        ADCUI_F0CTR_F0RARS_Msk

#define ADCUI_F0CTR_F0RRRS_Pos    4
#define ADCUI_F0CTR_F0RRRS_Msk    (0x1UL << ADCUI_F0CTR_F0RRRS_Pos)
#define ADCUI_F0CTR_F0RRRS        ADCUI_F0CTR_F0RRRS_Msk

#define ADCUI_F0CTR_F0RVRS_Pos    5
#define ADCUI_F0CTR_F0RVRS_Msk    (0x1UL << ADCUI_F0CTR_F0RVRS_Pos)
#define ADCUI_F0CTR_F0RVRS        ADCUI_F0CTR_F0RVRS_Msk

#define ADCUI_F0CTR_F0I0GAIN_Pos  6
#define ADCUI_F0CTR_F0I0GAIN_Msk  (0x3UL << ADCUI_F0CTR_F0I0GAIN_Pos)
#define ADCUI_F0CTR_F0I0GAIN_0dB  (0x0UL << ADCUI_F0CTR_F0I0GAIN_Pos)
#define ADCUI_F0CTR_F0I0GAIN_6dB  (0x1UL << ADCUI_F0CTR_F0I0GAIN_Pos)
#define ADCUI_F0CTR_F0I0GAIN_12dB (0x2UL << ADCUI_F0CTR_F0I0GAIN_Pos)
#define ADCUI_F0CTR_F0I0GAIN_18dB (0x3UL << ADCUI_F0CTR_F0I0GAIN_Pos)

#define ADCUI_F0CTR_F0VGAIN_Pos   8
#define ADCUI_F0CTR_F0VGAIN_Msk   (0x3UL << ADCUI_F0CTR_F0VGAIN_Pos)
#define ADCUI_F0CTR_F0VGAIN_0dB   (0x0UL << ADCUI_F0CTR_F0VGAIN_Pos)
#define ADCUI_F0CTR_F0VGAIN_6dB   (0x1UL << ADCUI_F0CTR_F0VGAIN_Pos)
#define ADCUI_F0CTR_F0VGAIN_12dB  (0x2UL << ADCUI_F0CTR_F0VGAIN_Pos)
#define ADCUI_F0CTR_F0VGAIN_18dB  (0x3UL << ADCUI_F0CTR_F0VGAIN_Pos)

#define ADCUI_F0CTR_F0VPHASE_Pos  10
#define ADCUI_F0CTR_F0VPHASE_Msk  (0xFFUL << ADCUI_F0CTR_F0VPHASE_Pos)

#define ADCUI_F0CTR_F0I3GAIN_Pos  18
#define ADCUI_F0CTR_F0I3GAIN_Msk  (0x3UL << ADCUI_F0CTR_F0I3GAIN_Pos)
#define ADCUI_F0CTR_F0I3GAIN_0dB  (0x0UL << ADCUI_F0CTR_F0I3GAIN_Pos)
#define ADCUI_F0CTR_F0I3GAIN_6dB  (0x1UL << ADCUI_F0CTR_F0I3GAIN_Pos)
#define ADCUI_F0CTR_F0I3GAIN_12dB (0x2UL << ADCUI_F0CTR_F0I3GAIN_Pos)
#define ADCUI_F0CTR_F0I3GAIN_18dB (0x3UL << ADCUI_F0CTR_F0I3GAIN_Pos)

#define ADCUI_F0CTR_F0IRMSOS_Pos  20
#define ADCUI_F0CTR_F0IRMSOS_Msk  (0xFFFUL << ADCUI_F0CTR_F0IRMSOS_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0CTR */

/** @defgroup MDR32F23QI_ADCUI_F0WC ADCUI_F0WC
 * @{
 */

#define ADCUI_F0WC_F0WATTOS_Pos 0
#define ADCUI_F0WC_F0WATTOS_Msk (0xFFFFUL << ADCUI_F0WC_F0WATTOS_Pos)
#define ADCUI_F0WC_F0WGAIN_Pos  16
#define ADCUI_F0WC_F0WGAIN_Msk  (0xFFFUL << ADCUI_F0WC_F0WGAIN_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0WC */

/** @defgroup MDR32F23QI_ADCUI_F0WATTP ADCUI_F0WATTP
 * @{
 */

#define ADCUI_F0WATTP_F0WATTHRP_Pos 0
#define ADCUI_F0WATTP_F0WATTHRP_Msk (0xFFFFFFFFUL << ADCUI_F0WATTP_F0WATTHRP_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0WATTP */

/** @defgroup MDR32F23QI_ADCUI_F0WATTN ADCUI_F0WATTN
 * @{
 */

#define ADCUI_F0WATTN_F0WATTHRN_Pos 0
#define ADCUI_F0WATTN_F0WATTHRN_Msk (0xFFFFFFFFUL << ADCUI_F0WATTN_F0WATTHRN_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0WATTN */

/** @defgroup MDR32F23QI_ADCUI_F0VC ADCUI_F0VC
 * @{
 */

#define ADCUI_F0VC_F0VAROS_Pos   0
#define ADCUI_F0VC_F0VAROS_Msk   (0xFFFFUL << ADCUI_F0VC_F0VAROS_Pos)

#define ADCUI_F0VC_F0VARGAIN_Pos 16
#define ADCUI_F0VC_F0VARGAIN_Msk (0xFFFUL << ADCUI_F0VC_F0VARGAIN_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0VC */

/** @defgroup MDR32F23QI_ADCUI_F0VARP ADCUI_F0VARP
 * @{
 */

#define ADCUI_F0VARP_F0VARHRP_Pos 0
#define ADCUI_F0VARP_F0VARHRP_Msk (0xFFFFFFFFUL << ADCUI_F0VARP_F0VARHRP_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0VARP */

