piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
/** @defgroup MDR32F23QI_ADCUI_F0VARN ADCUI_F0VARN
 * @{
 */

#define ADCUI_F0VARN_F0VARHRN_Pos 0
#define ADCUI_F0VARN_F0VARHRN_Msk (0xFFFFFFFFUL << ADCUI_F0VARN_F0VARHRN_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0VARN */

/** @defgroup MDR32F23QI_ADCUI_F0AC ADCUI_F0AC
 * @{
 */

#define ADCUI_F0AC_F0VRMSOS_Pos 0
#define ADCUI_F0AC_F0VRMSOS_Msk (0xFFFUL << ADCUI_F0AC_F0VRMSOS_Pos)

#define ADCUI_F0AC_F0VAGAIN_Pos 16
#define ADCUI_F0AC_F0VAGAIN_Msk (0xFFFUL << ADCUI_F0AC_F0VAGAIN_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0AC */

/** @defgroup MDR32F23QI_ADCUI_F0VR ADCUI_F0VR
 * @{
 */

#define ADCUI_F0VR_F0VAHR_Pos 0
#define ADCUI_F0VR_F0VAHR_Msk (0xFFFFFFFFUL << ADCUI_F0VR_F0VAHR_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0VR */

/** @defgroup MDR32F23QI_ADCUI_F0MD0 ADCUI_F0MD0
 * @{
 */

#define ADCUI_F0MD0_F0VSEL_Pos           0
#define ADCUI_F0MD0_F0VSEL_Msk           (0x3UL << ADCUI_F0MD0_F0VSEL_Pos)
#define ADCUI_F0MD0_F0VSEL_V             (0x0UL << ADCUI_F0MD0_F0VSEL_Pos)
#define ADCUI_F0MD0_F0VSEL_ACTIVEPOWER   (0x1UL << ADCUI_F0MD0_F0VSEL_Pos)
#define ADCUI_F0MD0_F0VSEL_REACTIVEPOWER (0x2UL << ADCUI_F0MD0_F0VSEL_Pos)
#define ADCUI_F0MD0_F0VSEL_FULLPOWER     (0x3UL << ADCUI_F0MD0_F0VSEL_Pos)

#define ADCUI_F0MD0_F0ISEL_Pos           2
#define ADCUI_F0MD0_F0ISEL_Msk           (0x3UL << ADCUI_F0MD0_F0ISEL_Pos)
#define ADCUI_F0MD0_F0ISEL_I             (0x0UL << ADCUI_F0MD0_F0ISEL_Pos)
#define ADCUI_F0MD0_F0ISEL_ACTIVEPOWER   (0x1UL << ADCUI_F0MD0_F0ISEL_Pos)
#define ADCUI_F0MD0_F0ISEL_REACTIVEPOWER (0x2UL << ADCUI_F0MD0_F0ISEL_Pos)
#define ADCUI_F0MD0_F0ISEL_FULLPOWER     (0x3UL << ADCUI_F0MD0_F0ISEL_Pos)

#define ADCUI_F0MD0_F0ACTS_Pos           4
#define ADCUI_F0MD0_F0ACTS_Msk           (0x1UL << ADCUI_F0MD0_F0ACTS_Pos)
#define ADCUI_F0MD0_F0ACTS               ADCUI_F0MD0_F0ACTS_Msk

#define ADCUI_F0MD0_F0REACTS_Pos         5
#define ADCUI_F0MD0_F0REACTS_Msk         (0x1UL << ADCUI_F0MD0_F0REACTS_Pos)
#define ADCUI_F0MD0_F0REACTS             ADCUI_F0MD0_F0REACTS_Msk

#define ADCUI_F0MD0_I0GAIN_Pos           6
#define ADCUI_F0MD0_I0GAIN_Msk           (0x1UL << ADCUI_F0MD0_I0GAIN_Pos)
#define ADCUI_F0MD0_I0GAIN               ADCUI_F0MD0_I0GAIN_Msk

#define ADCUI_F0MD0_V0GAIN_Pos           7
#define ADCUI_F0MD0_V0GAIN_Msk           (0x1UL << ADCUI_F0MD0_V0GAIN_Pos)
#define ADCUI_F0MD0_V0GAIN               ADCUI_F0MD0_V0GAIN_Msk

#define ADCUI_F0MD0_I3GAIN_Pos           8
#define ADCUI_F0MD0_I3GAIN_Msk           (0x1UL << ADCUI_F0MD0_I3GAIN_Pos)
#define ADCUI_F0MD0_I3GAIN               ADCUI_F0MD0_I3GAIN_Msk

#define ADCUI_F0MD0_F0PER_FREQ_Pos       12
#define ADCUI_F0MD0_F0PER_FREQ_Msk       (0x1FFFFUL << ADCUI_F0MD0_F0PER_FREQ_Pos)

#define ADCUI_F0MD0_F0I3SEL_Pos          29
#define ADCUI_F0MD0_F0I3SEL_Msk          (0x1UL << ADCUI_F0MD0_F0I3SEL_Pos)
#define ADCUI_F0MD0_F0I3SEL              ADCUI_F0MD0_F0I3SEL_Msk

#define ADCUI_F0MD0_F0SEL_I_CH_Pos       30
#define ADCUI_F0MD0_F0SEL_I_CH_Msk       (0x3UL << ADCUI_F0MD0_F0SEL_I_CH_Pos)
#define ADCUI_F0MD0_F0SEL_I_CH_AUTO      (0x0UL << ADCUI_F0MD0_F0SEL_I_CH_Pos)
#define ADCUI_F0MD0_F0SEL_I_CH_ACTIVEI0  (0x1UL << ADCUI_F0MD0_F0SEL_I_CH_Pos)
#define ADCUI_F0MD0_F0SEL_I_CH_ACTIVEI3  (0x2UL << ADCUI_F0MD0_F0SEL_I_CH_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0MD0 */

/** @defgroup MDR32F23QI_ADCUI_F0MD1 ADCUI_F0MD1
 * @{
 */

#define ADCUI_F0MD1_F0IPKLVL_Pos 0
#define ADCUI_F0MD1_F0IPKLVL_Msk (0xFFFFUL << ADCUI_F0MD1_F0IPKLVL_Pos)

#define ADCUI_F0MD1_F0VPKLVL_Pos 16
#define ADCUI_F0MD1_F0VPKLVL_Msk (0xFFFFUL << ADCUI_F0MD1_F0VPKLVL_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0MD1 */

/** @defgroup MDR32F23QI_ADCUI_F0VPEAK ADCUI_F0VPEAK
 * @{
 */

#define ADCUI_F0VPEAK_F0VPEAK_Pos 0
#define ADCUI_F0VPEAK_F0VPEAK_Msk (0xFFFFFFUL << ADCUI_F0VPEAK_F0VPEAK_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0VPEAK */

/** @defgroup MDR32F23QI_ADCUI_F0IPEAK ADCUI_F0IPEAK
 * @{
 */

#define ADCUI_F0IPEAK_F0IPEAK_Pos 0
#define ADCUI_F0IPEAK_F0IPEAK_Msk (0xFFFFFFUL << ADCUI_F0IPEAK_F0IPEAK_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0IPEAK */

/** @defgroup MDR32F23QI_ADCUI_F0VDAT ADCUI_F0VDAT
 * @{
 */

#define ADCUI_F0VDAT_F0VDAT_Pos 0
#define ADCUI_F0VDAT_F0VDAT_Msk (0xFFFFFFUL << ADCUI_F0VDAT_F0VDAT_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0VDAT */

/** @defgroup MDR32F23QI_ADCUI_F0I0DAT ADCUI_F0I0DAT
 * @{
 */

#define ADCUI_F0I0DAT_F0I0DAT_Pos 0
#define ADCUI_F0I0DAT_F0I0DAT_Msk (0xFFFFFFUL << ADCUI_F0I0DAT_F0I0DAT_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0I0DAT */

/** @defgroup MDR32F23QI_ADCUI_F0I3DAT ADCUI_F0I3DAT
 * @{
 */

#define ADCUI_F0I3DAT_F0I3DAT_Pos 0
#define ADCUI_F0I3DAT_F0I3DAT_Msk (0xFFFFFFUL << ADCUI_F0I3DAT_F0I3DAT_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0I3DAT */

/** @defgroup MDR32F23QI_ADCUI_F0VRMS ADCUI_F0VRMS
 * @{
 */

#define ADCUI_F0VRMS_F0VRMS_Pos 0
#define ADCUI_F0VRMS_F0VRMS_Msk (0xFFFFFFUL << ADCUI_F0VRMS_F0VRMS_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0VRMS */

/** @defgroup MDR32F23QI_ADCUI_F0VRMS2 ADCUI_F0VRMS2
 * @{
 */

#define ADCUI_F0VRMS2_F0VRMS2_Pos 0
#define ADCUI_F0VRMS2_F0VRMS2_Msk (0xFFFFFFFFUL << ADCUI_F0VRMS2_F0VRMS2_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0VRMS2 */

/** @defgroup MDR32F23QI_ADCUI_F0IRMS ADCUI_F0IRMS
 * @{
 */

#define ADCUI_F0IRMS_F0IRMS_Pos 0
#define ADCUI_F0IRMS_F0IRMS_Msk (0xFFFFFF << ADCUI_F0IRMS_F0IRMS_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0IRMS */

/** @defgroup MDR32F23QI_ADCUI_F0IRMS2 ADCUI_F0IRMS2
 * @{
 */

#define ADCUI_F0IRMS2_F0IRMS2_Pos 0
#define ADCUI_F0IRMS2_F0IRMS2_Msk (0xFFFFFFFF << ADCUI_F0IRMS2_F0IRMS2_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_F0IRMS2 */

/** @defgroup MDR32F23QI_ADCUI_F0STAT ADCUI_F0STAT
 * @{
 */

#define ADCUI_F0STAT_F0VF_EMP_Pos   0
#define ADCUI_F0STAT_F0VF_EMP_Msk   (0x1UL << ADCUI_F0STAT_F0VF_EMP_Pos)
#define ADCUI_F0STAT_F0VF_EMP       ADCUI_F0STAT_F0VF_EMP_Msk

#define ADCUI_F0STAT_F0VF_FLL_Pos   1
#define ADCUI_F0STAT_F0VF_FLL_Msk   (0x1UL << ADCUI_F0STAT_F0VF_FLL_Pos)
#define ADCUI_F0STAT_F0VF_FLL       ADCUI_F0STAT_F0VF_FLL_Msk

#define ADCUI_F0STAT_F0VF_OVR_Pos   2
#define ADCUI_F0STAT_F0VF_OVR_Msk   (0x1UL << ADCUI_F0STAT_F0VF_OVR_Pos)
#define ADCUI_F0STAT_F0VF_OVR       ADCUI_F0STAT_F0VF_OVR_Msk

#define ADCUI_F0STAT_F0IF_EMP_Pos   3
#define ADCUI_F0STAT_F0IF_EMP_Msk   (0x1UL << ADCUI_F0STAT_F0IF_EMP_Pos)
#define ADCUI_F0STAT_F0IF_EMP       ADCUI_F0STAT_F0IF_EMP_Msk

#define ADCUI_F0STAT_F0IF_FLL_Pos   4
#define ADCUI_F0STAT_F0IF_FLL_Msk   (0x1UL << ADCUI_F0STAT_F0IF_FLL_Pos)
#define ADCUI_F0STAT_F0IF_FLL       ADCUI_F0STAT_F0IF_FLL_Msk

#define ADCUI_F0STAT_F0IF_OVR_Pos   5
#define ADCUI_F0STAT_F0IF_OVR_Msk   (0x1UL << ADCUI_F0STAT_F0IF_OVR_Pos)
#define ADCUI_F0STAT_F0IF_OVR       ADCUI_F0STAT_F0IF_OVR_Msk

#define ADCUI_F0STAT_F0SAGF_Pos     6
#define ADCUI_F0STAT_F0SAGF_Msk     (0x1UL << ADCUI_F0STAT_F0SAGF_Pos)
#define ADCUI_F0STAT_F0SAGF         ADCUI_F0STAT_F0SAGF_Msk

#define ADCUI_F0STAT_F0PEAKVF_Pos   7
#define ADCUI_F0STAT_F0PEAKVF_Msk   (0x1UL << ADCUI_F0STAT_F0PEAKVF_Pos)
#define ADCUI_F0STAT_F0PEAKVF       ADCUI_F0STAT_F0PEAKVF_Msk

#define ADCUI_F0STAT_F0PEAKIF_Pos   8
#define ADCUI_F0STAT_F0PEAKIF_Msk   (0x1UL << ADCUI_F0STAT_F0PEAKIF_Pos)
#define ADCUI_F0STAT_F0PEAKIF       ADCUI_F0STAT_F0PEAKIF_Msk

