piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
#define ADCUI_F0MASK_C3IF_EMPM_Pos   22
#define ADCUI_F0MASK_C3IF_EMPM_Msk   (0x1UL << ADCUI_F0MASK_C3IF_EMPM_Pos)
#define ADCUI_F0MASK_C3IF_EMPM       ADCUI_F0MASK_C3IF_EMPM_Msk

#define ADCUI_F0MASK_C3IF_FLLM_Pos   23
#define ADCUI_F0MASK_C3IF_FLLM_Msk   (0x1UL << ADCUI_F0MASK_C3IF_FLLM_Pos)
#define ADCUI_F0MASK_C3IF_FLLM       ADCUI_F0MASK_C3IF_FLLM_Msk

#define ADCUI_F0MASK_C3IF_OVRM_Pos   24
#define ADCUI_F0MASK_C3IF_OVRM_Msk   (0x1UL << ADCUI_F0MASK_C3IF_OVRM_Pos)
#define ADCUI_F0MASK_C3IF_OVRM       ADCUI_F0MASK_C3IF_OVRM_Msk

#define ADCUI_F0MASK_F0WATTOVNM_Pos  25
#define ADCUI_F0MASK_F0WATTOVNM_Msk  (0x1UL << ADCUI_F0MASK_F0WATTOVNM_Pos)
#define ADCUI_F0MASK_F0WATTOVNM      ADCUI_F0MASK_F0WATTOVNM_Msk

#define ADCUI_F0MASK_F0VAROVNM_Pos   26
#define ADCUI_F0MASK_F0VAROVNM_Msk   (0x1UL << ADCUI_F0MASK_F0VAROVNM_Pos)
#define ADCUI_F0MASK_F0VAROVNM       ADCUI_F0MASK_F0VAROVNM_Msk

/** @} */ /* End of group MDR32F23QI_ADCUI_F0MASK */

/** @defgroup MDR32F23QI_ADCUI_CCAL1 ADCUI_CCAL1
 * @{
 */

#define ADCUI_CCAL1_V0BGAIN_Pos 0
#define ADCUI_CCAL1_V0BGAIN_Msk (0xFFFUL << ADCUI_CCAL1_V0BGAIN_Pos)

#define ADCUI_CCAL1_I0BGAIN_Pos 12
#define ADCUI_CCAL1_I0BGAIN_Msk (0xFFFUL << ADCUI_CCAL1_I0BGAIN_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_CCAL1 */

/** @defgroup MDR32F23QI_ADCUI_CCAL4 ADCUI_CCAL4
 * @{
 */

#define ADCUI_CCAL4_I3BGAIN_Pos 0
#define ADCUI_CCAL4_I3BGAIN_Msk (0xFFFUL << ADCUI_CCAL4_I3BGAIN_Pos)

/** @} */ /* End of group MDR32F23QI_ADCUI_CCAL4 */

/** @} */ /* End of group MDR32F23QI_ADCUI_Defines */

/** @} */ /* End of group MDR32F23QI_ADCUI */

/** @defgroup MDR32F23QI_TIMER MDR_TIMER
 * @{
 */

/**
 * @brief MDR32F23QI TIMER control structure
 */
typedef struct {
    __IO uint32_t CNT;          /*!<TIMER Counter Register */
    __IO uint32_t PSG;          /*!<TIMER Clock Prescaler Register */
    __IO uint32_t ARR;          /*!<TIMER Auto-Reload Register */
    __IO uint32_t CNTRL;        /*!<TIMER Control Register */
    __IO uint32_t CCR1;         /*!<TIMER Capture/Compare Register 1 */
    __IO uint32_t RESERVED0[3];
    __IO uint32_t CH1_CNTRL;    /*!<TIMER Channel 1 Control Register */
    __IO uint32_t RESERVED1[3];
    __IO uint32_t CH1_CNTRL1;   /*!<TIMER Channel 1 Control1 Register */
    __IO uint32_t RESERVED2[3];
    __IO uint32_t CH1_DTG;      /*!<TIMER Channel 1 DTG Register */
    __IO uint32_t RESERVED3[3];
    __IO uint32_t BRKETR_CNTRL; /*!<TIMER BRK/ETR Control Register */
    __IO uint32_t STATUS;       /*!<TIMER Status Register */
    __IO uint32_t IE;           /*!<TIMER Interrupt Enable Register */
    __IO uint32_t RESERVED4;
    __IO uint32_t CH1_CNTRL2;   /*!<TIMER Channel 1 Control2 Register */
    __IO uint32_t RESERVED5[3];
    __IO uint32_t CCR11;        /*!<TIMER Capture/Compare1 Register 1 */
} MDR_TIMER_TypeDef;

/** @defgroup MDR32F23QI_TIMER_Defines TIMER Defines
 * @{
 */

/** @defgroup MDR32F23QI_TIMER_CNT TIMER_CNT
 * @{
 */

#define TIMER_CNT_CNT_Pos 0
#define TIMER_CNT_CNT_Msk (0xFFFFUL << TIMER_CNT_CNT_Pos)

/** @} */ /* End of group MDR32F23QI_TIMER_CNT */

/** @defgroup MDR32F23QI_TIMER_PSG TIMER_PSG
 * @{
 */

#define TIMER_PSG_PSG_Pos 0
#define TIMER_PSG_PSG_Msk (0xFFFFUL << TIMER_PSG_PSG_Pos)

/** @} */ /* End of group MDR32F23QI_TIMER_PSG */

/** @defgroup MDR32F23QI_TIMER_ARR TIMER_ARR
 * @{
 */

#define TIMER_ARR_ARR_Pos 0
#define TIMER_ARR_ARR_Msk (0xFFFFUL << TIMER_ARR_ARR_Pos)

/** @} */ /* End of group MDR32F23QI_TIMER_ARR */

/** @defgroup MDR32F23QI_TIMER_CNTRL TIMER_CNTRL
 * @{
 */

#define TIMER_CNTRL_CNT_EN_Pos              0
#define TIMER_CNTRL_CNT_EN_Msk              (0x1UL << TIMER_CNTRL_CNT_EN_Pos)
#define TIMER_CNTRL_CNT_EN                  TIMER_CNTRL_CNT_EN_Msk

#define TIMER_CNTRL_ARRB_EN_Pos             1
#define TIMER_CNTRL_ARRB_EN_Msk             (0x1UL << TIMER_CNTRL_ARRB_EN_Pos)
#define TIMER_CNTRL_ARRB_EN                 TIMER_CNTRL_ARRB_EN_Msk

#define TIMER_CNTRL_WR_CMPL_Pos             2
#define TIMER_CNTRL_WR_CMPL_Msk             (0x1UL << TIMER_CNTRL_WR_CMPL_Pos)
#define TIMER_CNTRL_WR_CMPL                 TIMER_CNTRL_WR_CMPL_Msk

#define TIMER_CNTRL_DIR_Pos                 3
#define TIMER_CNTRL_DIR_Msk                 (0x1UL << TIMER_CNTRL_DIR_Pos)
#define TIMER_CNTRL_DIR                     TIMER_CNTRL_DIR_Msk

#define TIMER_CNTRL_FDTS_Pos                4
#define TIMER_CNTRL_FDTS_Msk                (0x3UL << TIMER_CNTRL_FDTS_Pos)
#define TIMER_CNTRL_FDTS_DIV_1              (0x0UL << TIMER_CNTRL_FDTS_Pos)
#define TIMER_CNTRL_FDTS_DIV_2              (0x1UL << TIMER_CNTRL_FDTS_Pos)
#define TIMER_CNTRL_FDTS_DIV_3              (0x2UL << TIMER_CNTRL_FDTS_Pos)
#define TIMER_CNTRL_FDTS_DIV_4              (0x3UL << TIMER_CNTRL_FDTS_Pos)

#define TIMER_CNTRL_CNT_MODE_Pos            6
#define TIMER_CNTRL_CNT_MODE_Msk            (0x3UL << TIMER_CNTRL_CNT_MODE_Pos)
#define TIMER_CNTRL_CNT_MODE_CLK_FIXED_DIR  (0x0UL << TIMER_CNTRL_CNT_MODE_Pos)
#define TIMER_CNTRL_CNT_MODE_CLK_CHANGE_DIR (0x1UL << TIMER_CNTRL_CNT_MODE_Pos)
#define TIMER_CNTRL_CNT_MODE_EVNT_FIXED_DIR (0x2UL << TIMER_CNTRL_CNT_MODE_Pos)

#define TIMER_CNTRL_EVENT_SEL_Pos           8
#define TIMER_CNTRL_EVENT_SEL_Msk           (0xFUL << TIMER_CNTRL_EVENT_SEL_Pos)
#define TIMER_CNTRL_EVENT_SEL_TIM_CLK       (0x0UL << TIMER_CNTRL_EVENT_SEL_Pos)
#define TIMER_CNTRL_EVENT_SEL_TIM0          (0x1UL << TIMER_CNTRL_EVENT_SEL_Pos)
#define TIMER_CNTRL_EVENT_SEL_TIM1          (0x2UL << TIMER_CNTRL_EVENT_SEL_Pos)
#define TIMER_CNTRL_EVENT_SEL_CH1           (0x4UL << TIMER_CNTRL_EVENT_SEL_Pos)
#define TIMER_CNTRL_EVENT_SEL_ETR_RE        (0x8UL << TIMER_CNTRL_EVENT_SEL_Pos)
#define TIMER_CNTRL_EVENT_SEL_ETR_FE        (0x9UL << TIMER_CNTRL_EVENT_SEL_Pos)

/** @} */ /* End of group MDR32F23QI_TIMER_CNTRL */

/** @defgroup MDR32F23QI_TIMER_CCR TIMER_CCR
 * @{
 */

#define TIMER_CCR_CCR_Pos 0
#define TIMER_CCR_CCR_Msk (0xFFFFUL << TIMER_CCR_CCR_Pos)

/** @} */ /* End of group MDR32F23QI_TIMER_CCR */

/** @defgroup MDR32F23QI_TIMER_CH1_CNTRL TIMER_CH1_CNTRL
 * @{
 */

