piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
#define TIMER_CH_CNTRL_CHFLTR_Pos           0
#define TIMER_CH_CNTRL_CHFLTR_Msk           (0xFUL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_1_FDTS        (0x0UL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_2_TIM_CLK     (0x1UL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_4_TIM_CLK     (0x2UL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_8_TIM_CLK     (0x3UL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_6_FDTS_DIV_2  (0x4UL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_8_FDTS_DIV_2  (0x5UL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_6_FDTS_DIV_4  (0x6UL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_8_FDTS_DIV_4  (0x7UL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_6_FDTS_DIV_8  (0x8UL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_8_FDTS_DIV_8  (0x9UL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_5_FDTS_DIV_16 (0xAUL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_6_FDTS_DIV_16 (0xBUL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_8_FDTS_DIV_16 (0xCUL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_5_FDTS_DIV_32 (0xDUL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_6_FDTS_DIV_32 (0xEUL << TIMER_CH_CNTRL_CHFLTR_Pos)
#define TIMER_CH_CNTRL_CHFLTR_8_FDTS_DIV_32 (0xFUL << TIMER_CH_CNTRL_CHFLTR_Pos)

#define TIMER_CH_CNTRL_CHSEL_Pos            4
#define TIMER_CH_CNTRL_CHSEL_Msk            (0x3UL << TIMER_CH_CNTRL_CHSEL_Pos)
#define TIMER_CH_CNTRL_CHSEL_CH_RE          (0x0UL << TIMER_CH_CNTRL_CHSEL_Pos)
#define TIMER_CH_CNTRL_CHSEL_CH_FE          (0x1UL << TIMER_CH_CNTRL_CHSEL_Pos)

#define TIMER_CH_CNTRL_CHPSC_Pos            6
#define TIMER_CH_CNTRL_CHPSC_Msk            (0x3UL << TIMER_CH_CNTRL_CHPSC_Pos)
#define TIMER_CH_CNTRL_CHPSC_DIV_1          (0x0UL << TIMER_CH_CNTRL_CHPSC_Pos)
#define TIMER_CH_CNTRL_CHPSC_DIV_2          (0x1UL << TIMER_CH_CNTRL_CHPSC_Pos)
#define TIMER_CH_CNTRL_CHPSC_DIV_4          (0x2UL << TIMER_CH_CNTRL_CHPSC_Pos)
#define TIMER_CH_CNTRL_CHPSC_DIV_8          (0x3UL << TIMER_CH_CNTRL_CHPSC_Pos)

#define TIMER_CH_CNTRL_OCCE_Pos             8
#define TIMER_CH_CNTRL_OCCE_Msk             (0x1UL << TIMER_CH_CNTRL_OCCE_Pos)
#define TIMER_CH_CNTRL_OCCE                 TIMER_CH_CNTRL_OCCE_Msk

#define TIMER_CH_CNTRL_OCCM_Pos             9
#define TIMER_CH_CNTRL_OCCM_Msk             (0x7UL << TIMER_CH_CNTRL_OCCM_Pos)
#define TIMER_CH_CNTRL_OCCM_FORMAT_0        (0x0UL << TIMER_CH_CNTRL_OCCM_Pos)
#define TIMER_CH_CNTRL_OCCM_FORMAT_1        (0x1UL << TIMER_CH_CNTRL_OCCM_Pos)
#define TIMER_CH_CNTRL_OCCM_FORMAT_2        (0x2UL << TIMER_CH_CNTRL_OCCM_Pos)
#define TIMER_CH_CNTRL_OCCM_FORMAT_3        (0x3UL << TIMER_CH_CNTRL_OCCM_Pos)
#define TIMER_CH_CNTRL_OCCM_FORMAT_4        (0x4UL << TIMER_CH_CNTRL_OCCM_Pos)
#define TIMER_CH_CNTRL_OCCM_FORMAT_5        (0x5UL << TIMER_CH_CNTRL_OCCM_Pos)
#define TIMER_CH_CNTRL_OCCM_FORMAT_6        (0x6UL << TIMER_CH_CNTRL_OCCM_Pos)
#define TIMER_CH_CNTRL_OCCM_FORMAT_7        (0x7UL << TIMER_CH_CNTRL_OCCM_Pos)

#define TIMER_CH_CNTRL_BRKEN_Pos            12
#define TIMER_CH_CNTRL_BRKEN_Msk            (0x1UL << TIMER_CH_CNTRL_BRKEN_Pos)
#define TIMER_CH_CNTRL_BRKEN                TIMER_CH_CNTRL_BRKEN_Msk

#define TIMER_CH_CNTRL_ETREN_Pos            13
#define TIMER_CH_CNTRL_ETREN_Msk            (0x1UL << TIMER_CH_CNTRL_ETREN_Pos)
#define TIMER_CH_CNTRL_ETREN                TIMER_CH_CNTRL_ETREN_Msk

#define TIMER_CH_CNTRL_WR_CMPL_Pos          14
#define TIMER_CH_CNTRL_WR_CMPL_Msk          (0x1UL << TIMER_CH_CNTRL_WR_CMPL_Pos)
#define TIMER_CH_CNTRL_WR_CMPL              TIMER_CH_CNTRL_WR_CMPL_Msk

#define TIMER_CH_CNTRL_CAP_nPWM_Pos         15
#define TIMER_CH_CNTRL_CAP_nPWM_Msk         (0x1UL << TIMER_CH_CNTRL_CAP_nPWM_Pos)
#define TIMER_CH_CNTRL_CAP_nPWM             TIMER_CH_CNTRL_CAP_nPWM_Msk

#define TIMER_CH_CNTRL_WR_CMPL1_Pos         16
#define TIMER_CH_CNTRL_WR_CMPL1_Msk         (0x1UL << TIMER_CH_CNTRL_WR_CMPL1_Pos)
#define TIMER_CH_CNTRL_WR_CMPL1             TIMER_CH_CNTRL_WR_CMPL1_Msk

/** @} */ /* End of group MDR32F23QI_TIMER_CH_CNTRL */

/** @defgroup MDR32F23QI_TIMER_CH_CNTRL1 TIMER_CH_CNTRL1
 * @{
 */

#define TIMER_CH_CNTRL1_SELOE_Pos   0
#define TIMER_CH_CNTRL1_SELOE_Msk   (0x3UL << TIMER_CH_CNTRL1_SELOE_Pos)
#define TIMER_CH_CNTRL1_SELOE_ALW0  (0x0UL << TIMER_CH_CNTRL1_SELOE_Pos)
#define TIMER_CH_CNTRL1_SELOE_ALW1  (0x1UL << TIMER_CH_CNTRL1_SELOE_Pos)
#define TIMER_CH_CNTRL1_SELOE_REF   (0x2UL << TIMER_CH_CNTRL1_SELOE_Pos)
#define TIMER_CH_CNTRL1_SELOE_DTG   (0x3UL << TIMER_CH_CNTRL1_SELOE_Pos)

#define TIMER_CH_CNTRL1_SELO_Pos    2
#define TIMER_CH_CNTRL1_SELO_Msk    (0x3UL << TIMER_CH_CNTRL1_SELO_Pos)
#define TIMER_CH_CNTRL1_SELO_ALW0   (0x0UL << TIMER_CH_CNTRL1_SELO_Pos)
#define TIMER_CH_CNTRL1_SELO_ALW1   (0x1UL << TIMER_CH_CNTRL1_SELO_Pos)
#define TIMER_CH_CNTRL1_SELO_REF    (0x2UL << TIMER_CH_CNTRL1_SELO_Pos)
#define TIMER_CH_CNTRL1_SELO_DTG    (0x3UL << TIMER_CH_CNTRL1_SELO_Pos)

#define TIMER_CH_CNTRL1_INV_Pos     4
#define TIMER_CH_CNTRL1_INV_Msk     (0x1UL << TIMER_CH_CNTRL1_INV_Pos)
#define TIMER_CH_CNTRL1_INV         TIMER_CH_CNTRL1_INV_Msk

#define TIMER_CH_CNTRL1_NSELOE_Pos  8
#define TIMER_CH_CNTRL1_NSELOE_Msk  (0x3UL << TIMER_CH_CNTRL1_NSELOE_Pos)
#define TIMER_CH_CNTRL1_NSELOE_ALW0 (0x0UL << TIMER_CH_CNTRL1_NSELOE_Pos)
#define TIMER_CH_CNTRL1_NSELOE_ALW1 (0x1UL << TIMER_CH_CNTRL1_NSELOE_Pos)
#define TIMER_CH_CNTRL1_NSELOE_REF  (0x2UL << TIMER_CH_CNTRL1_NSELOE_Pos)
#define TIMER_CH_CNTRL1_NSELOE_DTG  (0x3UL << TIMER_CH_CNTRL1_NSELOE_Pos)

#define TIMER_CH_CNTRL1_NSELO_Pos   10
#define TIMER_CH_CNTRL1_NSELO_Msk   (0x3UL << TIMER_CH_CNTRL1_NSELO_Pos)
#define TIMER_CH_CNTRL1_NSELO_ALW0  (0x0UL << TIMER_CH_CNTRL1_NSELO_Pos)
#define TIMER_CH_CNTRL1_NSELO_ALW1  (0x1UL << TIMER_CH_CNTRL1_NSELO_Pos)
#define TIMER_CH_CNTRL1_NSELO_REF   (0x2UL << TIMER_CH_CNTRL1_NSELO_Pos)
#define TIMER_CH_CNTRL1_NSELO_DTG   (0x3UL << TIMER_CH_CNTRL1_NSELO_Pos)

