piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
#define TIMER_CH_CNTRL1_NINV_Pos    12
#define TIMER_CH_CNTRL1_NINV_Msk    (0x1UL << TIMER_CH_CNTRL1_NINV_Pos)
#define TIMER_CH_CNTRL1_NINV        TIMER_CH_CNTRL1_NINV_Msk

/** @} */ /* End of group MDR32F23QI_TIMER_CH_CNTRL1 */

/** @defgroup MDR32F23QI_TIMER_CH_DTG TIMER_CH_DTG
 * @{
 */

#define TIMER_CH_DTG_DTGX_Pos 0
#define TIMER_CH_DTG_DTGX_Msk (0xFUL << TIMER_CH_DTG_DTGX_Pos)

#define TIMER_CH_DTG_EDTS_Pos 4
#define TIMER_CH_DTG_EDTS_Msk (0x1UL << TIMER_CH_DTG_EDTS_Pos)
#define TIMER_CH_DTG_EDTS     TIMER_CH_DTG_EDTS_Msk

#define TIMER_CH_DTG_DTG_Pos  8
#define TIMER_CH_DTG_DTG_Msk  (0xFFUL << TIMER_CH_DTG_DTG_Pos)

/** @} */ /* End of group MDR32F23QI_TIMER_CH_DTG */

/** @defgroup MDR32F23QI_TIMER_BRKETR_CNTRL TIMER_BRKETR_CNTRL
 * @{
 */

#define TIMER_BRKETR_CNTRL_BRK_INV_Pos              0
#define TIMER_BRKETR_CNTRL_BRK_INV_Msk              (0x1UL << TIMER_BRKETR_CNTRL_BRK_INV_Pos)
#define TIMER_BRKETR_CNTRL_BRK_INV                  TIMER_BRKETR_CNTRL_BRK_INV_Msk

#define TIMER_BRKETR_CNTRL_ETR_INV_Pos              1
#define TIMER_BRKETR_CNTRL_ETR_INV_Msk              (0x1UL << TIMER_BRKETR_CNTRL_ETR_INV_Pos)
#define TIMER_BRKETR_CNTRL_ETR_INV                  TIMER_BRKETR_CNTRL_ETR_INV_Msk

#define TIMER_BRKETR_CNTRL_ETR_PSC_Pos              2
#define TIMER_BRKETR_CNTRL_ETR_PSC_Msk              (0x3UL << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)
#define TIMER_BRKETR_CNTRL_ETR_PSC_DIV_1            (0x0UL << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)
#define TIMER_BRKETR_CNTRL_ETR_PSC_DIV_2            (0x1UL << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)
#define TIMER_BRKETR_CNTRL_ETR_PSC_DIV_4            (0x2UL << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)
#define TIMER_BRKETR_CNTRL_ETR_PSC_DIV_8            (0x3UL << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)

#define TIMER_BRKETR_CNTRL_ETR_FILTER_Pos           4
#define TIMER_BRKETR_CNTRL_ETR_FILTER_Msk           (0xFUL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_1_FDTS        (0x0UL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_2_TIM_CLK     (0x1UL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_4_TIM_CLK     (0x2UL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_8_TIM_CLK     (0x3UL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_6_FDTS_DIV_2  (0x4UL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_8_FDTS_DIV_2  (0x5UL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_6_FDTS_DIV_4  (0x6UL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_8_FDTS_DIV_4  (0x7UL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_6_FDTS_DIV_8  (0x8UL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_8_FDTS_DIV_8  (0x9UL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_5_FDTS_DIV_16 (0xAUL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_6_FDTS_DIV_16 (0xBUL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_8_FDTS_DIV_16 (0xCUL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_5_FDTS_DIV_32 (0xDUL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_6_FDTS_DIV_32 (0xEUL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FILTER_8_FDTS_DIV_32 (0xFUL << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)

/** @} */ /* End of group MDR32F23QI_TIMER_BRKETR_CNTRL */

/** @defgroup MDR32F23QI_TIMER_STATUS TIMER_STATUS
 * @{
 */

#define TIMER_STATUS_CNT_ZERO_EVENT_Pos     0
#define TIMER_STATUS_CNT_ZERO_EVENT_Msk     (0x1UL << TIMER_STATUS_CNT_ZERO_EVENT_Pos)
#define TIMER_STATUS_CNT_ZERO_EVENT         TIMER_STATUS_CNT_ZERO_EVENT_Msk

#define TIMER_STATUS_CNT_ARR_EVENT_Pos      1
#define TIMER_STATUS_CNT_ARR_EVENT_Msk      (0x1UL << TIMER_STATUS_CNT_ARR_EVENT_Pos)
#define TIMER_STATUS_CNT_ARR_EVENT          TIMER_STATUS_CNT_ARR_EVENT_Msk

#define TIMER_STATUS_ETR_RE_EVENT_Pos       2
#define TIMER_STATUS_ETR_RE_EVENT_Msk       (0x1UL << TIMER_STATUS_ETR_RE_EVENT_Pos)
#define TIMER_STATUS_ETR_RE_EVENT           TIMER_STATUS_ETR_RE_EVENT_Msk

#define TIMER_STATUS_ETR_FE_EVENT_Pos       3
#define TIMER_STATUS_ETR_FE_EVENT_Msk       (0x1UL << TIMER_STATUS_ETR_FE_EVENT_Pos)
#define TIMER_STATUS_ETR_FE_EVENT           TIMER_STATUS_ETR_FE_EVENT_Msk

#define TIMER_STATUS_BRK_EVENT_Pos          4
#define TIMER_STATUS_BRK_EVENT_Msk          (0x1UL << TIMER_STATUS_BRK_EVENT_Pos)
#define TIMER_STATUS_BRK_EVENT              TIMER_STATUS_BRK_EVENT_Msk

#define TIMER_STATUS_CCR_CAP_EVENT_CH1_Pos  5
#define TIMER_STATUS_CCR_CAP_EVENT_CH1_Msk  (0x1UL << TIMER_STATUS_CCR_CAP_EVENT_CH1_Pos)
#define TIMER_STATUS_CCR_CAP_EVENT_CH1      TIMER_STATUS_CCR_CAP_EVENT_CH1_Msk

#define TIMER_STATUS_CCR_REF_EVENT_CH1_Pos  9
#define TIMER_STATUS_CCR_REF_EVENT_CH1_Msk  (0x1UL << TIMER_STATUS_CCR_REF_EVENT_CH1_Pos)
#define TIMER_STATUS_CCR_REF_EVENT_CH1      TIMER_STATUS_CCR_REF_EVENT_CH1_Msk

#define TIMER_STATUS_CCR_CAP1_EVENT_CH1_Pos 13
#define TIMER_STATUS_CCR_CAP1_EVENT_CH1_Msk (0x1UL << TIMER_STATUS_CCR_CAP1_EVENT_CH1_Pos)
#define TIMER_STATUS_CCR_CAP1_EVENT_CH1     TIMER_STATUS_CCR_CAP1_EVENT_CH1_Msk

/** @} */ /* End of group MDR32F23QI_TIMER_STATUS */

/** @defgroup MDR32F23QI_TIMER_IE TIMER_IE
 * @{
 */

#define TIMER_IE_CNT_ZERO_EVENT_IE_Pos     0
#define TIMER_IE_CNT_ZERO_EVENT_IE_Msk     (0x1UL << TIMER_IE_CNT_ZERO_EVENT_IE_Pos)
#define TIMER_IE_CNT_ZERO_EVENT_IE         TIMER_IE_CNT_ZERO_EVENT_IE_Msk

#define TIMER_IE_CNT_ARR_EVENT_IE_Pos      1
#define TIMER_IE_CNT_ARR_EVENT_IE_Msk      (0x1UL << TIMER_IE_CNT_ARR_EVENT_IE_Pos)
#define TIMER_IE_CNT_ARR_EVENT_IE          TIMER_IE_CNT_ARR_EVENT_IE_Msk

#define TIMER_IE_ETR_RE_EVENT_IE_Pos       2
#define TIMER_IE_ETR_RE_EVENT_IE_Msk       (0x1UL << TIMER_IE_ETR_RE_EVENT_IE_Pos)
#define TIMER_IE_ETR_RE_EVENT_IE           TIMER_IE_ETR_RE_EVENT_IE_Msk

#define TIMER_IE_ETR_FE_EVENT_IE_Pos       3
#define TIMER_IE_ETR_FE_EVENT_IE_Msk       (0x1UL << TIMER_IE_ETR_FE_EVENT_IE_Pos)
#define TIMER_IE_ETR_FE_EVENT_IE           TIMER_IE_ETR_FE_EVENT_IE_Msk

#define TIMER_IE_BRK_EVENT_IE_Pos          4
#define TIMER_IE_BRK_EVENT_IE_Msk          (0x1UL << TIMER_IE_BRK_EVENT_IE_Pos)
#define TIMER_IE_BRK_EVENT_IE              TIMER_IE_BRK_EVENT_IE_Msk

#define TIMER_IE_CCR_CAP_EVENT_IE_CH1_Pos  5
#define TIMER_IE_CCR_CAP_EVENT_IE_CH1_Msk  (0x1UL << TIMER_IE_CCR_CAP_EVENT_IE_CH1_Pos)
#define TIMER_IE_CCR_CAP_EVENT_IE_CH1      TIMER_IE_CCR_CAP_EVENT_IE_CH1_Msk

#define TIMER_IE_CCR_REF_EVENT_IE_CH1_Pos  9
#define TIMER_IE_CCR_REF_EVENT_IE_CH1_Msk  (0x1UL << TIMER_IE_CCR_REF_EVENT_IE_CH1_Pos)
#define TIMER_IE_CCR_REF_EVENT_IE_CH1      TIMER_IE_CCR_REF_EVENT_IE_CH1_Msk

#define TIMER_IE_CCR_CAP1_EVENT_IE_CH1_Pos 13
#define TIMER_IE_CCR_CAP1_EVENT_IE_CH1_Msk (0x1UL << TIMER_IE_CCR_CAP1_EVENT_IE_CH1_Pos)
#define TIMER_IE_CCR_CAP1_EVENT_IE_CH1     TIMER_IE_CCR_CAP1_EVENT_IE_CH1_Msk

/** @} */ /* End of group MDR32F23QI_TIMER_IE */

