piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
/** @defgroup MDR32F23QI_TIMER_CH_CNTRL2 TIMER_CH_CNTRL2
 * @{
 */

#define TIMER_CH_CNTRL2_CHSEL_Pos    0
#define TIMER_CH_CNTRL2_CHSEL_Msk    (0x3UL << TIMER_CH_CNTRL2_CHSEL_Pos)
#define TIMER_CH_CNTRL2_CHSEL_CH_RE  (0x0UL << TIMER_CH_CNTRL2_CHSEL_Pos)
#define TIMER_CH_CNTRL2_CHSEL_CH_FE  (0x1UL << TIMER_CH_CNTRL2_CHSEL_Pos)

#define TIMER_CH_CNTRL2_CCR1_EN_Pos  2
#define TIMER_CH_CNTRL2_CCR1_EN_Msk  (0x1UL << TIMER_CH_CNTRL2_CCR1_EN_Pos)
#define TIMER_CH_CNTRL2_CCR1_EN      TIMER_CH_CNTRL2_CCR1_EN_Msk

#define TIMER_CH_CNTRL2_CCRRLD_Pos   3
#define TIMER_CH_CNTRL2_CCRRLD_Msk   (0x1UL << TIMER_CH_CNTRL2_CCRRLD_Pos)
#define TIMER_CH_CNTRL2_CCRRLD       TIMER_CH_CNTRL2_CCRRLD_Msk

#define TIMER_CH_CNTRL2_EV_DELAY_Pos 4
#define TIMER_CH_CNTRL2_EV_DELAY_Msk (0x1UL << TIMER_CH_CNTRL2_EV_DELAY_Pos)
#define TIMER_CH_CNTRL2_EV_DELAY     TIMER_CH_CNTRL2_EV_DELAY_Msk

/** @} */ /* End of group MDR32F23QI_TIMER_CH_CNTRL2 */

/** @defgroup MDR32F23QI_TIMER_CCR1 TIMER_CCR1
 * @{
 */

#define TIMER_CCR1_CCR1_Pos 0
#define TIMER_CCR1_CCR1_Msk (0xFFFFUL << TIMER_CCR1_CCR1_Pos)

/** @} */ /* End of group MDR32F23QI_TIMER_CCR1 */

/** @} */ /* End of group MDR32F23QI_TIMER_Defines */

/** @} */ /* End of group MDR32F23QI_TIMER */

/** @defgroup MDR32F23QI_PORT MDR_PORT
 * @{
 */

/**
 * @brief MDR32F23QI PORT control structure
 */
typedef struct {
    __IO uint32_t RXTX;   /*!<PORT Data Register */
    __IO uint32_t OE;     /*!<PORT Output Enable Register */
    __IO uint32_t FUNC;   /*!<PORT Function Register */
    __IO uint32_t ANALOG; /*!<PORT Analog Function Register */
    __IO uint32_t PULL;   /*!<PORT Pull Up/Down Register */
    __IO uint32_t PD;     /*!<PORT Driver Mode Register */
    __IO uint32_t PWR;    /*!<PORT Power Register */
    __IO uint32_t GFEN;   /*!<PORT Filter Configuration Register */
    __IO uint32_t SETTX;  /*!<PORT Set Output Register */
    __IO uint32_t CLRTX;  /*!<PORT Reset Output Register */
    __IO uint32_t RDTX;   /*!<PORT Read Output Register */
} MDR_PORT_TypeDef;

/** @defgroup MDR32F23QI_PORT_Defines PORT Defines
 * @{
 */

/** @defgroup MDR32F23QI_PORT_RXTX PORT_RXTX
 * @{
 */

#define PORT_RXTX_RXTX_Pos 0
#define PORT_RXTX_RXTX_Msk (0xFFFFUL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX0    (0x0001UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX1    (0x0002UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX2    (0x0004UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX3    (0x0008UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX4    (0x0010UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX5    (0x0020UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX6    (0x0040UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX7    (0x0080UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX8    (0x0100UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX9    (0x0200UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX10   (0x0400UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX11   (0x0800UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX12   (0x1000UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX13   (0x2000UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX14   (0x4000UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX15   (0x8000UL << PORT_RXTX_RXTX_Pos)

/** @} */ /* End of group MDR32F23QI_PORT_RXTX */

/** @defgroup MDR32F23QI_PORT_OE PORT_OE
 * @{
 */

#define PORT_OE_OE_Pos 0
#define PORT_OE_OE_Msk (0xFFFFUL << PORT_OE_OE_Pos)
#define PORT_OE_OE0    (0x0001UL << PORT_OE_OE_Pos)
#define PORT_OE_OE1    (0x0002UL << PORT_OE_OE_Pos)
#define PORT_OE_OE2    (0x0004UL << PORT_OE_OE_Pos)
#define PORT_OE_OE3    (0x0008UL << PORT_OE_OE_Pos)
#define PORT_OE_OE4    (0x0010UL << PORT_OE_OE_Pos)
#define PORT_OE_OE5    (0x0020UL << PORT_OE_OE_Pos)
#define PORT_OE_OE6    (0x0040UL << PORT_OE_OE_Pos)
#define PORT_OE_OE7    (0x0080UL << PORT_OE_OE_Pos)
#define PORT_OE_OE8    (0x0100UL << PORT_OE_OE_Pos)
#define PORT_OE_OE9    (0x0200UL << PORT_OE_OE_Pos)
#define PORT_OE_OE10   (0x0400UL << PORT_OE_OE_Pos)
#define PORT_OE_OE11   (0x0800UL << PORT_OE_OE_Pos)
#define PORT_OE_OE12   (0x1000UL << PORT_OE_OE_Pos)
#define PORT_OE_OE13   (0x2000UL << PORT_OE_OE_Pos)
#define PORT_OE_OE14   (0x4000UL << PORT_OE_OE_Pos)
#define PORT_OE_OE15   (0x8000UL << PORT_OE_OE_Pos)

/** @} */ /* End of group MDR32F23QI_PORT_OE */

/** @defgroup MDR32F23QI_PORT_FUNC PORT_FUNC
 * @{
 */

#define PORT_FUNC_MODE_Pos 0
#define PORT_FUNC_MODE_Msk (0xFFFFFFFFUL)
#define PORT_FUNC_MODE0    (0x00000003UL)
#define PORT_FUNC_MODE1    (0x0000000CUL)
#define PORT_FUNC_MODE2    (0x00000030UL)
#define PORT_FUNC_MODE3    (0x000000C0UL)
#define PORT_FUNC_MODE4    (0x00000300UL)
#define PORT_FUNC_MODE5    (0x00000C00UL)
#define PORT_FUNC_MODE6    (0x00003000UL)
#define PORT_FUNC_MODE7    (0x0000C000UL)
#define PORT_FUNC_MODE8    (0x00030000UL)
#define PORT_FUNC_MODE9    (0x000C0000UL)
#define PORT_FUNC_MODE10   (0x00300000UL)
#define PORT_FUNC_MODE11   (0x00C00000UL)
#define PORT_FUNC_MODE12   (0x03000000UL)
#define PORT_FUNC_MODE13   (0x0C000000UL)
#define PORT_FUNC_MODE14   (0x30000000UL)
#define PORT_FUNC_MODE15   (0xC0000000UL)

/** @} */ /* End of group MDR32F23QI_PORT_FUNC */

/** @defgroup MDR32F23QI_PORT_ANALOG PORT_ANALOG
 * @{
 */

#define PORT_ANALOG_ANALOG_EN_Pos 0
#define PORT_ANALOG_ANALOG_EN_Msk (0xFFFFUL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN0    (0x0001UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN1    (0x0002UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN2    (0x0004UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN3    (0x0008UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN4    (0x0010UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN5    (0x0020UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN6    (0x0040UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN7    (0x0080UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN8    (0x0100UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN9    (0x0200UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN10   (0x0400UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN11   (0x0800UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN12   (0x1000UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN13   (0x2000UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN14   (0x4000UL << PORT_ANALOG_ANALOG_EN_Pos)
#define PORT_ANALOG_ANALOG_EN15   (0x8000UL << PORT_ANALOG_ANALOG_EN_Pos)

/** @} */ /* End of group MDR32F23QI_PORT_ANALOG */

/** @defgroup MDR32F23QI_PORT_PULL PORT_PULL
 * @{
 */

