piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
#define PORT_PULL_PULL_DOWN_Pos 0
#define PORT_PULL_PULL_DOWN_Msk (0xFFFFUL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN0    (0x0001UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN1    (0x0002UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN2    (0x0004UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN3    (0x0008UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN4    (0x0010UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN5    (0x0020UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN6    (0x0040UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN7    (0x0080UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN8    (0x0100UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN9    (0x0200UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN10   (0x0400UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN11   (0x0800UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN12   (0x1000UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN13   (0x2000UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN14   (0x4000UL << PORT_PULL_PULL_DOWN_Pos)
#define PORT_PULL_PULL_DOWN15   (0x8000UL << PORT_PULL_PULL_DOWN_Pos)

#define PORT_PULL_PULL_UP_Pos   16
#define PORT_PULL_PULL_UP_Msk   (0xFFFFUL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP0      (0x0001UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP1      (0x0002UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP2      (0x0004UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP3      (0x0008UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP4      (0x0010UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP5      (0x0020UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP6      (0x0040UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP7      (0x0080UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP8      (0x0100UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP9      (0x0200UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP10     (0x0400UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP11     (0x0800UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP12     (0x1000UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP13     (0x2000UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP14     (0x4000UL << PORT_PULL_PULL_UP_Pos)
#define PORT_PULL_PULL_UP15     (0x8000UL << PORT_PULL_PULL_UP_Pos)

/** @} */ /* End of group MDR32F23QI_PORT_PULL */

/** @defgroup MDR32F23QI_PORT_PD PORT_PD
 * @{
 */

#define PORT_PD_PD_Pos  0
#define PORT_PD_PD_Msk  (0xFFFFUL << PORT_PD_PD_Pos)
#define PORT_PD_PD0     (0x0001UL << PORT_PD_PD_Pos)
#define PORT_PD_PD1     (0x0002UL << PORT_PD_PD_Pos)
#define PORT_PD_PD2     (0x0004UL << PORT_PD_PD_Pos)
#define PORT_PD_PD3     (0x0008UL << PORT_PD_PD_Pos)
#define PORT_PD_PD4     (0x0010UL << PORT_PD_PD_Pos)
#define PORT_PD_PD5     (0x0020UL << PORT_PD_PD_Pos)
#define PORT_PD_PD6     (0x0040UL << PORT_PD_PD_Pos)
#define PORT_PD_PD7     (0x0080UL << PORT_PD_PD_Pos)
#define PORT_PD_PD8     (0x0100UL << PORT_PD_PD_Pos)
#define PORT_PD_PD9     (0x0200UL << PORT_PD_PD_Pos)
#define PORT_PD_PD10    (0x0400UL << PORT_PD_PD_Pos)
#define PORT_PD_PD11    (0x0800UL << PORT_PD_PD_Pos)
#define PORT_PD_PD12    (0x1000UL << PORT_PD_PD_Pos)
#define PORT_PD_PD13    (0x2000UL << PORT_PD_PD_Pos)
#define PORT_PD_PD14    (0x4000UL << PORT_PD_PD_Pos)
#define PORT_PD_PD15    (0x8000UL << PORT_PD_PD_Pos)

#define PORT_PD_SHM_Pos 16
#define PORT_PD_SHM_Msk (0xFFFFUL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM0    (0x0001UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM1    (0x0002UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM2    (0x0004UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM3    (0x0008UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM4    (0x0010UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM5    (0x0020UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM6    (0x0040UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM7    (0x0080UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM8    (0x0100UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM9    (0x0200UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM10   (0x0400UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM11   (0x0800UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM12   (0x1000UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM13   (0x2000UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM14   (0x4000UL << PORT_PD_SHM_Pos)
#define PORT_PD_SHM15   (0x8000UL << PORT_PD_SHM_Pos)

/** @} */ /* End of group MDR32F23QI_PORT_PD */

/** @defgroup MDR32F23QI_PORT_PWR PORT_PWR
 * @{
 */

#define PORT_PWR_PWR_Pos 0
#define PORT_PWR_PWR_Msk (0xFFFFFFFFUL)
#define PORT_PWR_PWR0    (0x00000003UL)
#define PORT_PWR_PWR1    (0x0000000CUL)
#define PORT_PWR_PWR2    (0x00000030UL)
#define PORT_PWR_PWR3    (0x000000C0UL)
#define PORT_PWR_PWR4    (0x00000300UL)
#define PORT_PWR_PWR5    (0x00000C00UL)
#define PORT_PWR_PWR6    (0x00003000UL)
#define PORT_PWR_PWR7    (0x0000C000UL)
#define PORT_PWR_PWR8    (0x00030000UL)
#define PORT_PWR_PWR9    (0x000C0000UL)
#define PORT_PWR_PWR10   (0x00300000UL)
#define PORT_PWR_PWR11   (0x00C00000UL)
#define PORT_PWR_PWR12   (0x03000000UL)
#define PORT_PWR_PWR13   (0x0C000000UL)
#define PORT_PWR_PWR14   (0x30000000UL)
#define PORT_PWR_PWR15   (0xC0000000UL)

/** @} */ /* End of group MDR32F23QI_PORT_PWR */

/** @defgroup MDR32F23QI_PORT_GFEN PORT_GFEN
 * @{
 */

#define PORT_GFEN_GFEN_Pos 0
#define PORT_GFEN_GFEN_Msk (0xFFFFUL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN0    (0x0001UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN1    (0x0002UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN2    (0x0004UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN3    (0x0008UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN4    (0x0010UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN5    (0x0020UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN6    (0x0040UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN7    (0x0080UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN8    (0x0100UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN9    (0x0200UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN10   (0x0400UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN11   (0x0800UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN12   (0x1000UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN13   (0x2000UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN14   (0x4000UL << PORT_GFEN_GFEN_Pos)
#define PORT_GFEN_GFEN15   (0x8000UL << PORT_GFEN_GFEN_Pos)

/** @} */ /* End of group MDR32F23QI_PORT_GFEN */

