piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
/** @defgroup MDR32F23QI_PORT_SETTX PORT_SETTX
 * @{
 */

#define PORT_SETTX_SETTX_Pos 0
#define PORT_SETTX_SETTX_Msk (0xFFFFUL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX0    (0x0001UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX1    (0x0002UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX2    (0x0004UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX3    (0x0008UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX4    (0x0010UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX5    (0x0020UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX6    (0x0040UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX7    (0x0080UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX8    (0x0100UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX9    (0x0200UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX10   (0x0400UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX11   (0x0800UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX12   (0x1000UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX13   (0x2000UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX14   (0x4000UL << PORT_SETTX_SETTX_Pos)
#define PORT_SETTX_SETTX15   (0x8000UL << PORT_SETTX_SETTX_Pos)

/** @} */ /* End of group MDR32F23QI_PORT_SETTX */

/** @defgroup MDR32F23QI_PORT_CLRTX PORT_CLRTX
 * @{
 */

#define PORT_CLRTX_CLRTX_Pos 0
#define PORT_CLRTX_CLRTX_Msk (0xFFFFUL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX0    (0x0001UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX1    (0x0002UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX2    (0x0004UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX3    (0x0008UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX4    (0x0010UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX5    (0x0020UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX6    (0x0040UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX7    (0x0080UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX8    (0x0100UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX9    (0x0200UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX10   (0x0400UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX11   (0x0800UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX12   (0x1000UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX13   (0x2000UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX14   (0x4000UL << PORT_CLRTX_CLRTX_Pos)
#define PORT_CLRTX_CLRTX15   (0x8000UL << PORT_CLRTX_CLRTX_Pos)

/** @} */ /* End of group MDR32F23QI_PORT_CLRTX */

/** @defgroup MDR32F23QI_PORT_RDTX PORT_RDTX
 * @{
 */

#define PORT_RDTX_RDTX_Pos 0
#define PORT_RDTX_RDTX_Msk (0xFFFFUL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX0    (0x0001UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX1    (0x0002UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX2    (0x0004UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX3    (0x0008UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX4    (0x0010UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX5    (0x0020UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX6    (0x0040UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX7    (0x0080UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX8    (0x0100UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX9    (0x0200UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX10   (0x0400UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX11   (0x0800UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX12   (0x1000UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX13   (0x2000UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX14   (0x4000UL << PORT_RDTX_RDTX_Pos)
#define PORT_RDTX_RDTX15   (0x8000UL << PORT_RDTX_RDTX_Pos)

/** @} */ /* End of group MDR32F23QI_PORT_RDTX */

/** @} */ /* End of group MDR32F23QI_PORT_Defines */

/** @} */ /* End of group MDR32F23QI_PORT */

/** @defgroup MDR32F23QI_LCD LCD
 * @{
 */

/**
 * @brief MDR32F23QI LCD control structure
 */
typedef struct {
    __IO uint32_t CR;    /*!<LCD Control Register */
    __IO uint32_t ROW1;  /*!<LCD Main Memory Data Row Register for Output BP0 */
    __IO uint32_t ROW2;  /*!<LCD Main Memory Data Row Register for Output BP1 */
    __IO uint32_t ROW3;  /*!<LCD Main Memory Data Row Register for Output BP2 */
    __IO uint32_t ROW4;  /*!<LCD Main Memory Data Row Register for Output BP3 */
    __IO uint32_t AROW1; /*!<LCD Alter Memory Data Row Register for Output BP0 */
    __IO uint32_t AROW2; /*!<LCD Alter Memory Data Row Register for Output BP1 */
    __IO uint32_t AROW3; /*!<LCD Alter Memory Data Row Register for Output BP2 */
    __IO uint32_t AROW4; /*!<LCD Alter Memory Data Row Register for Output BP3 */
} MDR_LCD_TypeDef;

/** @defgroup MDR32F23QI_LCD_Defines LCD Defines
 * @{
 */

/** @defgroup MDR32F23QI_LCD_CR LCD_CR
 * @{
 */

#define LCD_CR_M_Pos       0
#define LCD_CR_M_Msk       (0x3UL << LCD_CR_M_Pos)
#define LCD_CR_M_STATIC    (0x0UL << LCD_CR_M_Pos)
#define LCD_CR_M_DIV_2     (0x1UL << LCD_CR_M_Pos)
#define LCD_CR_M_DIV_3     (0x2UL << LCD_CR_M_Pos)
#define LCD_CR_M_DIV_4     (0x3UL << LCD_CR_M_Pos)

#define LCD_CR_B_Pos       2
#define LCD_CR_B_Msk       (0x1UL << LCD_CR_B_Pos)
#define LCD_CR_B           LCD_CR_B_Msk

#define LCD_CR_E_Pos       3
#define LCD_CR_E_Msk       (0x1UL << LCD_CR_E_Pos)
#define LCD_CR_E           LCD_CR_E_Msk

#define LCD_CR_BF_Pos      4
#define LCD_CR_BF_Msk      (0x3UL << LCD_CR_BF_Pos)
#define LCD_CR_BF_OFF      (0x0UL << LCD_CR_BF_Pos)
#define LCD_CR_BF_2Hz      (0x1UL << LCD_CR_BF_Pos)
#define LCD_CR_BF_1Hz      (0x2UL << LCD_CR_BF_Pos)
#define LCD_CR_BF_0p5Hz    (0x3UL << LCD_CR_BF_Pos)

#define LCD_CR_A_Pos       6
#define LCD_CR_A_Msk       (0x1UL << LCD_CR_A_Pos)
#define LCD_CR_A           LCD_CR_A_Msk

#define LCD_CR_VLCDON_Pos  7
#define LCD_CR_VLCDON_Msk  (0x1UL << LCD_CR_VLCDON_Pos)
#define LCD_CR_VLCDON      LCD_CR_VLCDON_Msk

#define LCD_CR_DIV_Pos     8
#define LCD_CR_DIV_Msk     (0xFFFFUL << LCD_CR_DIV_Pos)

#define LCD_CR_CLK_SEL_Pos 24
#define LCD_CR_CLK_SEL_Msk (0x1UL << LCD_CR_CLK_SEL_Pos)
#define LCD_CR_CLK_SEL     LCD_CR_CLK_SEL_Msk

/** @} */ /* End of group MDR32F23QI_LCD_CR */

/** @defgroup MDR32F23QI_LCD_ROW1 LCD_ROW1
 * @{
 */

#define LCD_ROW1_S_Pos 0
#define LCD_ROW1_S_Msk (0x3FFFFFFFUL << LCD_ROW1_S_Pos)

/** @} */ /* End of group MDR32F23QI_LCD_ROW1 */

/** @defgroup MDR32F23QI_LCD_ROW2 LCD_ROW2
 * @{
 */

