piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F23QI/inc/MDR32F23QI.h
#define LCD_ROW2_S_Pos 0
#define LCD_ROW2_S_Msk (0x3FFFFFFFUL << LCD_ROW2_S_Pos)

/** @} */ /* End of group MDR32F23QI_LCD_ROW2 */

/** @defgroup MDR32F23QI_LCD_ROW3 LCD_ROW3
 * @{
 */

#define LCD_ROW3_S_Pos 0
#define LCD_ROW3_S_Msk (0x3FFFFFFFUL << LCD_ROW3_S_Pos)

/** @} */ /* End of group MDR32F23QI_LCD_ROW3 */

/** @defgroup MDR32F23QI_LCD_ROW4 LCD_ROW4
 * @{
 */

#define LCD_ROW4_S_Pos 0
#define LCD_ROW4_S_Msk (0x3FFFFFFFUL << LCD_ROW4_S_Pos)

/** @} */ /* End of group MDR32F23QI_LCD_ROW4 */

/** @defgroup MDR32F23QI_LCD_AROW1 LCD_AROW1
 * @{
 */

#define LCD_AROW1_S_Pos 0
#define LCD_AROW1_S_Msk (0x3FFFFFFFUL << LCD_AROW1_S_Pos)

/** @} */ /* End of group LCD_AROW1*/

/** @defgroup MDR32F23QI_LCD_AROW2 LCD_AROW2
 * @{
 */

#define LCD_AROW2_S_Pos 0
#define LCD_AROW2_S_Msk (0x3FFFFFFFUL << LCD_AROW2_S_Pos)

/** @} */ /* End of group MDR32F23QI_LCD_AROW2 */

/** @defgroup MDR32F23QI_LCD_AROW3 LCD_AROW3
 * @{
 */

#define LCD_AROW3_S_Pos 0
#define LCD_AROW3_S_Msk (0x3FFFFFFFUL << LCD_AROW3_S_Pos)

/** @} */ /* End of group MDR32F23QI_LCD_AROW3 */

/** @defgroup MDR32F23QI_LCD_AROW4 LCD_AROW4
 * @{
 */

#define LCD_AROW4_S_Pos 0
#define LCD_AROW4_S_Msk (0x3FFFFFFFUL << LCD_AROW4_S_Pos)

/** @} */ /* End of group MDR32F23QI_LCD_AROW4 */

/** @} */ /* End of group MDR32F23QI_LCD_Defines */

/** @} */ /* End of group MDR32F23QI_LCD */

/** @defgroup MDR32F23QI_I2C I2C
 * @{
 */

/**
 * @brief MDR32F23QI I2C control structure
 */
typedef struct
{
    __IO uint32_t PRL; /*!<I2C Frequency Prescaler Lower Part Register */
    __IO uint32_t PRH; /*!<I2C Frequency Prescaler High Part Register */
    __IO uint32_t CTR; /*!<I2C Control Register */
    __IO uint32_t RXD; /*!<I2C Received Data Register */
    __IO uint32_t STA; /*!<I2C Status Register */
    __IO uint32_t TXD; /*!<I2C Transmitting Data Register */
    __IO uint32_t CMD; /*!<I2C Command Register */
} MDR_I2C_TypeDef;

/** @defgroup MDR32F23QI_I2C_Defines I2C Defines
 * @{
 */

/** @defgroup MDR32F23QI_I2C_PRL I2C_PRL
 * @{
 */

#define I2C_PRL_PR_Pos 0
#define I2C_PRL_PR_Msk (0xFFUL << I2C_PRL_PR_Pos)

/** @} */ /* End of group MDR32F23QI_I2C_PRL */

/** @defgroup MDR32F23QI_I2C_PRH I2C_PRH
 * @{
 */

#define I2C_PRH_PR_Pos 0
#define I2C_PRH_PR_Msk (0xFFUL << I2C_PRH_PR_Pos)

/** @} */ /* End of group MDR32F23QI_I2C_PRH */

/** @defgroup MDR32F23QI_I2C_CTR I2C_CTR
 * @{
 */

#define I2C_CTR_S_I2C_Pos  5
#define I2C_CTR_S_I2C_Msk  (0x1UL << I2C_CTR_S_I2C_Pos)
#define I2C_CTR_S_I2C      I2C_CTR_S_I2C_Msk

#define I2C_CTR_EN_INT_Pos 6
#define I2C_CTR_EN_INT_Msk (0x1UL << I2C_CTR_EN_INT_Pos)
#define I2C_CTR_EN_INT     I2C_CTR_EN_INT_Msk

#define I2C_CTR_EN_I2C_Pos 7
#define I2C_CTR_EN_I2C_Msk (0x1UL << I2C_CTR_EN_I2C_Pos)
#define I2C_CTR_EN_I2C     I2C_CTR_EN_I2C_Msk

/** @} */ /* End of group MDR32F23QI_I2C_CTR */

/** @defgroup MDR32F23QI_I2C_RXD I2C_RXD
 * @{
 */

#define I2C_RXD_RXD_Pos 0
#define I2C_RXD_RXD_Msk (0xFFUL << I2C_RXD_RXD_Pos)

/** @} */ /* End of group MDR32F23QI_I2C_RXD */

/** @defgroup MDR32F23QI_I2C_STA I2C_STA
 * @{
 */

#define I2C_STA_INT_Pos      0
#define I2C_STA_INT_Msk      (0x1UL << I2C_STA_INT_Pos)
#define I2C_STA_INT          I2C_STA_INT_Msk

#define I2C_STA_TR_PROG_Pos  1
#define I2C_STA_TR_PROG_Msk  (0x1UL << I2C_STA_TR_PROG_Pos)
#define I2C_STA_TR_PROG      I2C_STA_TR_PROG_Msk

#define I2C_STA_LOST_ARB_Pos 5
#define I2C_STA_LOST_ARB_Msk (0x1UL << I2C_STA_LOST_ARB_Pos)
#define I2C_STA_LOST_ARB     I2C_STA_LOST_ARB_Msk

#define I2C_STA_BUSY_Pos     6
#define I2C_STA_BUSY_Msk     (0x1UL << I2C_STA_BUSY_Pos)
#define I2C_STA_BUSY         I2C_STA_BUSY_Msk

#define I2C_STA_RX_ACK_Pos   7
#define I2C_STA_RX_ACK_Msk   (0x1UL << I2C_STA_RX_ACK_Pos)
#define I2C_STA_RX_ACK       I2C_STA_RX_ACK_Msk

/** @} */ /* End of group MDR32F23QI_I2C_STA */

/** @defgroup MDR32F23QI_I2C_TXD I2C_TXD
 * @{
 */

#define I2C_TXD_TXD_Pos 0
#define I2C_TXD_TXD_Msk (0xFFUL << I2C_TXD_TXD_Pos)

/** @} */ /* End of group MDR32F23QI_I2C_TXD */

/** @defgroup MDR32F23QI_I2C_CMD I2C_CMD
 * @{
 */

#define I2C_CMD_CLRINT_Pos 0
#define I2C_CMD_CLRINT_Msk (0x1UL << I2C_CMD_CLRINT_Pos)
#define I2C_CMD_CLRINT     I2C_CMD_CLRINT_Msk

#define I2C_CMD_ACK_Pos    3
#define I2C_CMD_ACK_Msk    (0x1UL << I2C_CMD_ACK_Pos)
#define I2C_CMD_ACK        I2C_CMD_ACK_Msk

#define I2C_CMD_WR_Pos     4
#define I2C_CMD_WR_Msk     (0x1UL << I2C_CMD_WR_Pos)
#define I2C_CMD_WR         I2C_CMD_WR_Msk

#define I2C_CMD_RD_Pos     5
#define I2C_CMD_RD_Msk     (0x1UL << I2C_CMD_RD_Pos)
#define I2C_CMD_RD         I2C_CMD_RD_Msk

#define I2C_CMD_STOP_Pos   6
#define I2C_CMD_STOP_Msk   (0x1UL << I2C_CMD_STOP_Pos)
#define I2C_CMD_STOP       I2C_CMD_STOP_Msk

#define I2C_CMD_START_Pos  7
#define I2C_CMD_START_Msk  (0x1UL << I2C_CMD_START_Pos)
#define I2C_CMD_START      I2C_CMD_START_Msk

/** @} */ /* End of group MDR32F23QI_I2C_CMD */

/** @} */ /* End of group MDR32F23QI_I2C_Defines */

/** @} */ /* End of group MDR32F23QI_I2C */

/** @} */ /* End of group MDR32F23QI_Peripheral_Units */

/** @defgroup MDR32F23QI_Peripheral_Memory_Map MDR32F23QI Peripheral Memory Map
 * @{
 */

#define MDR_SSP_BASE     (0x40000000)
#define MDR_UART0_BASE   (0x40008000)
#define MDR_UART1_BASE   (0x40010000)
#define MDR_EEPROM_BASE  (0x40018000)
#define MDR_RST_CLK_BASE (0x40020000)
#define MDR_I2C_BASE     (0x40030000)
#define MDR_LCD_BASE     (0x40038000)
#define MDR_ADC_BASE     (0x40040000)
#define MDR_WWDG_BASE    (0x40048000)
#define MDR_IWDG_BASE    (0x40050000)
#define MDR_POWER_BASE   (0x40058000)
#define MDR_BKP_BASE     (0x40060000)
#define MDR_ADCUI_BASE   (0x40068000)
#define MDR_TIMER0_BASE  (0x40070000)
#define MDR_TIMER1_BASE  (0x40078000)
#define MDR_PORTA_BASE   (0x40080000)
#define MDR_PORTB_BASE   (0x40088000)
#define MDR_PORTC_BASE   (0x40090000)

/** @} */ /* End of group MDR32F23QI_Peripheral_Memory_Map */

/** @defgroup MDR32F23QI_Peripheral_Declaration MDR32F23QI Peripheral Declaration
 * @{
 */

#define MDR_SSP     ((MDR_SSP_TypeDef*)MDR_SSP_BASE)
#define MDR_UART0   ((MDR_UART_TypeDef*)MDR_UART0_BASE)
#define MDR_UART1   ((MDR_UART_TypeDef*)MDR_UART1_BASE)
#define MDR_EEPROM  ((MDR_EEPROM_TypeDef*)MDR_EEPROM_BASE)
#define MDR_RST_CLK ((MDR_RST_CLK_TypeDef*)MDR_RST_CLK_BASE)
#define MDR_I2C     ((MDR_I2C_TypeDef*)MDR_I2C_BASE)
#define MDR_LCD     ((MDR_LCD_TypeDef*)MDR_LCD_BASE)
#define MDR_ADC     ((MDR_ADC_TypeDef*)MDR_ADC_BASE)
#define MDR_WWDG    ((MDR_WWDG_TypeDef*)MDR_WWDG_BASE)
#define MDR_IWDG    ((MDR_IWDG_TypeDef*)MDR_IWDG_BASE)
#define MDR_POWER   ((MDR_POWER_TypeDef*)MDR_POWER_BASE)
#define MDR_BKP     ((MDR_BKP_TypeDef*)MDR_BKP_BASE)
#define MDR_ADCUI   ((MDR_ADCUI_TypeDef*)MDR_ADCUI_BASE)
#define MDR_TIMER0  ((MDR_TIMER_TypeDef*)MDR_TIMER0_BASE)
#define MDR_TIMER1  ((MDR_TIMER_TypeDef*)MDR_TIMER1_BASE)
#define MDR_PORTA   ((MDR_PORT_TypeDef*)MDR_PORTA_BASE)
#define MDR_PORTB   ((MDR_PORT_TypeDef*)MDR_PORTB_BASE)
#define MDR_PORTC   ((MDR_PORT_TypeDef*)MDR_PORTC_BASE)

/** @} */ /* End of group MDR32F23QI_Peripheral_Declaration */

#ifdef __cplusplus
} // extern "C" block end
#endif

/** @} */ /* End of group MDR32F23QI_Peripheral */

/** @} */ /* End of group MDR32F23QI */

/** @} */ /* End of group CMSIS */

#endif    /* __MDR32F23QI_H */

/*********************** (C) COPYRIGHT 2025 Milandr ****************************
 *
 * END OF FILE MDR32F23QI.h */

